nguyentri/da-pac/svd/DA1470x.svd
4   : 3.00V
5   : 3.05V
6   : 3.10V
7   : 3.15V
8   : 3.20V
9   : 3.25V
10 : 3.30V
11 : 3.35V
12 : 3.40V
13 : 3.45V
14 : 3.50V
15 : 3.55V
16 : 3.60V
17 : 3.65V
18 : 3.70V
19 : 3.75V
20 : 3.80V
21 : 3.82V
22 : 3.84V
23 : 3.86V
24 : 3.88V
25 : 3.90V
26 : 3.92V
27 : 3.94V
28 : 3.96V
29 : 3.98V
30 : 4.00V
31 : 4.02V
32 : 4.04V
33 : 4.06V
34 : 4.08V
35 : 4.10V
36 : 4.12V
37 : 4.14V
38 : 4.16V
39 : 4.18V
40 : 4.20V
41 : 4.22V
42 : 4.24V
43 : 4.26V
44 : 4.28V
45 : 4.30V
46 : 4.32V
47 : 4.34V
48 : 4.36V
49 : 4.38V
50 : 4.40V
51 : 4.42V
52 : 4.44V
53 : 4.46V
54 : 4.48V
55 : 4.50V
56 : 4.52V
57 : 4.54V
58 : 4.56V
59 : 4.58V
60 : 4.60V
61 : 4.70V
62 : 4.80V
63 : 4.90V*
It has to be noted that the specific values correspond to the normal battery temperature zone. However, the specific register field may be updated by the JEITA FSM (which checks the battery temperature either once or periodically), in order to adapt the charge voltage to the battery temperature zone (see also CHARGER_CTRL_REG.TBAT_MONITOR_MODE field as well). This is valid also for the other three fields of the current register. Consequently, in that case the register returns the Charge voltage settings that abide to the JEITA requirements for the battery (either COOL, WARM or NORMAL).
Note: Option &quot;63&quot; (4.90V) is not supported for V_CHARGE, V_PRECHARGE and V_REPLENISH bit-fields (and respective levels). It should be used only in the V_OVP bit-field, as the (maximum) Over-voltage protection level.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_VOLTAGE_STATUS_REG</name>
	<description>Charger voltage status register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00d9f1e8</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>V_OVP_SET</name>
	<description>This bit-field returns the applied V_OVP setting. In JEITA charging, it contains the value corresponding to the present battery temperature zone, according to JEITA_V_OVP_REG. If JEITA charging is disabled, it reflects the V_OVP bit-field of CHARGER_VOLTAGE_PARAM_REG.
The specific bit-field is updated by the battery monitoring (JEITA) FSM, as soon as the latter starts running. Until then, it reflects the corresponding bit-field of CHARGER_VOLTAGE_PARAM_REG.</description>
	<bitRange>[23:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>V_REPLENISH_SET</name>
	<description>This bit-field returns the applied V_REPLENISH setting. In JEITA charging, it contains the value corresponding to the present battery temperature zone, according to JEITA_V_REPLENISH_REG. If JEITA charging is disabled, it reflects the V_REPLENISH bit-field of CHARGER_VOLTAGE_PARAM_REG.
The specific bit-field is updated by the battery monitoring (JEITA) FSM, as soon as the latter starts running. Until then, it reflects the corresponding bit-field of CHARGER_VOLTAGE_PARAM_REG.</description>
	<bitRange>[17:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>V_PRECHARGE_SET</name>
	<description>This bit-field returns the applied V_PRECHARGE setting. In JEITA charging, it contains the value corresponding to the present battery temperature zone, according to JEITA_V_PRECHARGE_REG. If JEITA charging is disabled, it reflects the V_PRECHARGE bit-field of CHARGER_VOLTAGE_PARAM_REG.
The specific bit-field is updated by the battery monitoring (JEITA) FSM, as soon as the latter starts running. Until then, it reflects the corresponding bit-field of CHARGER_VOLTAGE_PARAM_REG.</description>
	<bitRange>[11:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>V_CHARGE_SET</name>
	<description>This bit-field returns the applied V_CHARGE setting. In JEITA charging, it contains the value corresponding to the present battery temperature zone, according to JEITA_V_CHARGE_REG. If JEITA charging is disabled, it reflects the V_CHARGE bit-field of CHARGER_VOLTAGE_PARAM_REG.
The specific bit-field is updated by the battery monitoring (JEITA) FSM, as soon as the latter starts running. Until then, it reflects corresponding the bit-field of CHARGER_VOLTAGE_PARAM_REG.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHARGER_VOVP_COMP_TIMER_REG</name>
	<description>Vbat OVP comparator timer register</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000fc63</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>OVP_INTERVAL_CHECK_TIMER</name>
	<description>The specific bit-field determines the current state of the timer used to periodically check the output of the Over-Voltage Protection comparator's output signal, as soon as the Charger's FSM reaches any of the charging states (PRE/CC/CV_CHARGE).
When this happens, the timer starts ticking with the 1Mhz clock, ranging from 0 up to the programmed interval threshold (see also OVP_INTERVAL_CHECK_THRES field). As soon as this timer reaches the programmed threshold value, the Vbat OVP comparator's output is evaluated, increasing or not the counter keeping the consecutive OVP events. It is noted that out of the charging states, the specific timer is kept frozen to zero, not counting.
Note : See also the OVP_OCCURRENCES_CNT bit-field of CHARGER_STATUS_REG for the consecutive OVP events counter.</description>
	<bitRange>[31:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VBAT_OVP_COMP_TIMER</name>
	<description>Returns the current value of the timer used to determine when the Vbat Over-Voltage protection (OVP) comparator's output must be sampled by the digital. As soon as the timer expires (down-counting to 0, starting from VBAT_OVP_COMP_SETTLING), the comparator's output is latched by the Charger's digital block and used by the main FSM.
Note: When the Charger's FSM is in BYPASSED state, this timer is kept to zero and the SW takes over, sampling the status of the VBAT_OVP_COMP_OUT bit-field of CHARGER_STATUS_REG to determine if the Vbat has exceeded the OVP limit.</description>
	<bitRange>[25:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>OVP_INTERVAL_CHECK_THRES</name>
	<description>This bit-field determines the periodic interval of checking the dedicated Vbat OVP comparator's output, when the Charger's FSM is in any of the charging states (PRE/CC/CV_CHARGE). The implementation is based on a dedicated timer, counting from zero up to the value programmed into this bit-field (see also OVP_INTERVAL_CHECK_TIMER field's description) and only when the FSM is in any of the three charging states. Out of these states, the timer is kept frozen to zero.
As soon as this timer reaches the programmed threshold, the Vbat OVP comparator's output is sampled and depending on its level, (high or low), another counter, keeping the number of consecutive OVP events, is increased or not. The programmed threshold value should always be non-zero.
Note: See also the OVP_DEBOUNCE_CNT bit-field of CHARGER_STATUS_REG, for the consecutive OVP events counter.</description>
	<bitRange>[15:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VBAT_OVP_COMP_SETTLING</name>
	<description>Settling time threshold (in us) for the Vbat comparator checking Vbat vs the programmed Over-Voltage level.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CHG_DET</name>
	<version>1.0</version>
	<description>CHG_DET registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040300</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>40</size>
	<usage>registers</usage>
</addressBlock>
	
