nguyentri/da-pac/svd/DA1470x.svd
	<addressOffset>0x000000d0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000480</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields><field>
	<name>IBIAS_10N_TRIM</name>
	
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RET_V30_TRIM</name>
	
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_V30_TRIM</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>POR_CTRL_REG</name>
	<description>Controls the POR on VBAT</description>
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000820</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>POR_VSYS_SLEEP_CYCLE_EN</name>
	<description>Enables POR_VSYS during BOD check cycles in sleep (If POR_VSYS_DISABLE = 0)</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VSYS_HYST_SEL</name>
	<description>&quot;Selects POR_VSYS threshold level, when hysteresis is disabled (see POR_VSYS_DISABLE)
0: Vthres = VTH_L (low level)
1: Vthres = VTH_H (high level)&quot;</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VSYS_HYST_DISABLE</name>
	<description>Disable POR_VSYS hysteresis.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VSYS_FORCE_ON</name>
	<description>FORCE POR_VSYS to be ON (also in SLEEP)</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VSYS_MASK</name>
	<description>Mask POR on VSYS</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_VSYS_DISABLE</name>
	<description>Disable POR_VSYS</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_V30_SLEEP_CYCLE_EN</name>
	<description>Enables POR_V30 during BOD check cycles in sleep (If POR_V30_DISABLE = 0)
</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_V30_HYST_SEL</name>
	<description>Selects POR_VDDA_3V0 threshold level, when hysteresis is disabled (see POR_VDDA_3V0_HYST_DISABLE)
0: Vthres = VTH_L (low level)
1: Vthres = VTH_H (high level)</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_V30_HYST_DISABLE</name>
	<description>Disable POR_VDDA_3V0 hysteresis; select level with POR_VDDA_3V0_HYST_SEL</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_V30_FORCE_ON</name>
	<description>Force POR_VDDA_3V0 always ON, (also in SLEEP)</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_V30_MASK</name>
	<description>Mask POR_VDDA_3V0</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_V30_DISABLE</name>
	<description>Disable POR_VDDA_3V0</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>POR_PIN_REG</name>
	<description>Selects a GPIO pin for POR generation</description>
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000007f</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>POR_PIN_POLARITY</name>
	<description>0: Active Low
1: Active High
Note: This applies only for the GPIO pin. Reset pad is always active High
</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_PIN_SELECT</name>
	<description>0x00: P0_00
...
0x1f: P0_31
0x20: P1_00
...
0x3F: P1_31
0x40: P2_00
...
0x4E: P2_14
0x4F to 0x7E: reserved
0x7F: POR generation disabled</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>POR_TIMER_REG</name>
	<description>Time for POR to happen</description>
	<addressOffset>0x0000009c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000018</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>POR_TIME</name>
	<description>Time for the POReset to happen.
Formula:
Time = POR_TIME x 4096 x RC32 clock period
Default value: ~3 seconds
</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>POWER_CTRL_REG</name>
	<description>Power control register</description>
	<addressOffset>0x000000f0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000cc393</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SW_V18F_SLEEP_ON</name>
	<description>Closes the V18F switch in sleep when DCDC_V18P_SLEEP_EN is 1. See SW_V18F register for more settings.</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SW_V18F_ON</name>
	<description>Closes the V18F switch when DCDC_V18P_EN is 1. See SW_V18F register for more settings.</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VLED_SLEEP_EN</name>
	<description>Enables boost dcdc led rail in sleep mode</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VLED_EN</name>
	<description>Enables boost dcdc led rail in active mode</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_SLEEP_EN</name>
	<description>Enables buck dcdc V18p rail in sleep mode</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_EN</name>
	<description>Enables buck dcdc V18p rail in active mode</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_SLEEP_EN</name>
	<description>Enables buck dcdc V18 rail in sleep mode</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_EN</name>
	<description>Enables buck dcdc V18 rail in active mode</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_SLEEP_EN</name>
	<description>Enables buck dcdc V14 rail in sleep mode</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_EN</name>
	<description>Enables buck dcdc V14 rail in active mode</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V12_SLEEP_EN</name>
	<description>Enables buck dcdc V12 rail in sleep mode</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V12_EN</name>
	<description>Enables buck dcdc V12 rail in active mode</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLAMP_V12_DIS</name>
	<description>Disables V12 clamp. During Hibernation, V12 clamp will be enabled regardless of this bit.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLAMP_V30_EN</name>
	<description>Enables V30 clamp.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_MIPI_EN</name>
	<description>Enables ldo MIPI when DCDC_V18P_EN is 1</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RET_V30_SLEEP_EN</name>
	<description>Enables ldo V30 ret in sleep mode</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RET_V30_EN</name>
	<description>Enables ldo V30 ret in active mode</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_V30_SLEEP_EN</name>
	<description>Enables ldo V30 in sleep mode</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_V30_EN</name>
	<description>Enables ldo V30 in active mode</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_START_EN</name>
	<description>Enables ldo start.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>POWER_LVL_REG</name>
	
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00009830</resetValue>
	<resetMask>0x0007ffff</resetMask>
	<fields><field>
	<name>VSYS_LEVEL</name>
	<description>Level setting for VSYS rail when ldo_vsys is enabled (COMP_VBUS_OK &amp; COMP_VBUS_ABOVE_VSYS): 
0=4.8V
1=4.6V
2=4.4V
3=4.2V </description>
	<bitRange>[18:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V18_LEVEL</name>
	<description>Level setting for V18 rail:
0=1.8V
1=1.2V</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V14_LEVEL</name>
	<description>Level setting for V14 rail:
0=1.2V
1=1.3V
2=1.4V
3=1.5V</description>
	<bitRange>[15:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V12_SLEEP_LEVEL</name>
	<description>Level setting for V12 rail in sleep:
0=0.75V
1=0.9V
2=1.2V
3=reserved</description>
	<bitRange>[13:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V12_LEVEL</name>
	<description>Level setting for V12 rail:
0=0.75V
1=0.9V
2=1.2V
3=reserved</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V30_SLEEP_LEVEL</name>
	<description>Level setting for V30 in sleep:
0x0: 3.0V
0x1: reserved
0x2: 3.3V
0x3: 3.3V
</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V30_LEVEL</name>
	<description>Level setting for V30:
0x0: 3.0V
0x1: reserved
0x2: 3.3V
0x3: 3.3V
</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VMIPI_LEVEL</name>
	<description>LDO MIPI level: 0.9V+0.05V*LDO_MIPI_LEVEL. Default=1.2V
</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLAMP_V12_LEVEL</name>
	<description>Level setting for V12 clamp, retained in hibernation (only V12 source in Hibernation). Typical output voltages (not regulated):
</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RAM_PWR_CTRL_REG</name>
	<description>Control power state of System RAMS</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields><field>
	<name>RAM13_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[27:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM12_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM11_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[23:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM10_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[21:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM9_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[19:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM8_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM7_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[15:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM6_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[13:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM5_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM4_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM3_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM2_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM1_PWR_CTRL</name>
	<description>See description of RAM0_PWR_CTRL.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM0_PWR_CTRL</name>
	<description>Power state control of the individual RAMs. May only change when the memory isn't accessed.
When PD_MEM_IS_UP:
0x0: Normal operation
0x1: Normal operation
0x2: Retained (no access possible)
0x3: Off (memory content corrupted)
When PD_MEM_IS_DOWN:
0x0: Retained
0x1: Off (memory content corrupted)
0x2: Retained
0x3: Off (memory content corrupted)</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RESET_STAT_REG</name>
	<description>Reset status register</description>
	<addressOffset>0x000000bc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000007f</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>SNC_WDOGRESET_STAT</name>
	<description>Indicates that a SNC-Watchdog timeout has happened. Note that it is also set when a POReset has happened.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMAC_WDOGRESET_STAT</name>
	<description>Indicates that a CMAC-Watchdog timeout has happened. Note that it is also set when a POReset has happened.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SWD_HWRESET_STAT</name>
	<description>Indicates that a write to SWD_RESET_REG has happened. Note that it is also set when a POReset has happened.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WDOGRESET_STAT</name>
	<description>Indicates that a Watchdog timeout has happened. Note that it is also set when a POReset has happened.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SWRESET_STAT</name>
	<description>Indicates that a SW Reset has happened</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HWRESET_STAT</name>
	<description>Indicates that a HW Reset has happened</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PORESET_STAT</name>
	<description>Indicates that a PowerOn Reset has happened.
All bitfields of RESET_STAT_REG should be read (in order to check the source of reset) and then cleared to '0', allowing thus the HW to automatically set to '1' the proper bitfields during the next reset event.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RST_CTRL_REG</name>
	<description>Reset control register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>SYS_CACHE_FLUSH_WITH_SW_RESET</name>
	<description>0: Flush the System Cache memory only at HW reset.
1: Flush the System Cache memory also at SW reset.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SECURE_BOOT_REG</name>
	<description>Controls secure booting</description>
	<addressOffset>0x000000cc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>PROT_OTP_CS_WRITE</name>
	<description>This bit will permanentlly disable any write action to the CS inside the OTP</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FORCE_SNC_DEBUGGER_OFF</name>
	<description>This bit will permanently disable the SNC debugger</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PROT_OQSPIF_KEY_READ</name>
	<description>This bit will permanently disable CPU read capability at OTP offset 0x00000B00 and for the complete segment</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PROT_OQSPIF_KEY_WRITE</name>
	<description>This bit will permanently disable ANY write capability at OTP offset 0x00000B00 and for the complete segment </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PROT_AES_KEY_READ</name>
	<description>This bit will permanently disable CPU read capability at OTP offset 0x00000A00 and for the complete segment </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PROT_AES_KEY_WRITE</name>
	<description>This bit will permanently disable ANY write capability at OTP offset 0x00000A00 and for the complete segment </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PROT_SIG_KEY_WRITE</name>
	<description>This bit will permanently disable ANY write capability at OTP offset 0x000008C0 and for the complete segment </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FORCE_CMAC_DEBUGGER_OFF</name>
	<description>This bit will permanently disable the CMAC debugger</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FORCE_DEBUGGER_OFF</name>
	<description>Follows the respective OTP flag value. Its value is updated by the BootROM code.
1: The system debugger SWD is totally disabled.
0: The system debugger is enabled with DEBUGGER_ENABLE</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SECURE_BOOT</name>
	<description>Follows the respective OTP flag value. Its value is updated by the BootROM code.
1: system is a secure system supporting secure boot
0: system is not supporting secure boot</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SLP_MAP_REG</name>
	<description>Map signals on GPIOs during sleep</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>LCD_INV_EXT_CLK_SLP_MAP</name>
	<description>Maps inverted LCD_EXT_CLK on P0_10, for LCD XFRP function
This state is preserved during deep sleep, to allow pin output toggle on the pad during deep sleep.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCD_EXT_CLK_SLP_MAP</name>
	<description>Maps LCD_EXT_CLK on P0_19, for LCD VCOM/FRP/EXTCOMIN function
This state is preserved during deep sleep, to allow pin output toggle on the pad during deep sleep.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BANDGAP_SLP_MAP</name>
	<description>Setting this bit will:

