nguyentri/da-pac/svd/DA1470x.svd
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC2SYS_IRQ_BIT</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC2CMAC_IRQ_BIT</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS2SNC_IRQ_BIT</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS2CMAC_IRQ_BIT</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SET_SYS_IRQ_CTRL_REG</name>
	<description>System IRQ SET register</description>
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>CMAC2SNC_IRQ_BIT</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMAC2SYS_IRQ_BIT</name>
	
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC2SYS_IRQ_BIT</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC2CMAC_IRQ_BIT</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS2SNC_IRQ_BIT</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS2CMAC_IRQ_BIT</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SYS_IRQ_CTRL_REG</name>
	<description>System IRQ control register</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>CMAC2SNC_IRQ_BIT</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMAC2SYS_IRQ_BIT</name>
	
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC2SYS_IRQ_BIT</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC2CMAC_IRQ_BIT</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS2SNC_IRQ_BIT</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS2CMAC_IRQ_BIT</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_CAP_MEAS_REG</name>
	<description>Capacitance measure circuit control</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000090</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>XTAL32M_MEAS_TIME</name>
	<description>Select measurement time (in DIVN clock-cycles)
0: 32
1: 64

6: 2048
7: 4096</description>
	<bitRange>[8:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_MEAS_START</name>
	<description>Starts capacitance measurement</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_MEAS_CUR</name>
	<description>Select measurement current (minimum required capacitance)
0: 100nA (0.44pF)
1: 500nA (2.22pF)
2: 1uA (4.44pF)
3: 5uA (22.2pF)</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CAP_SELECT</name>
	<description>Select measured capacitance
0: disabled
1: hold capacitance
2: xtal_p
3: xtal_n
4: xtal_p + xtal_n
5: low reference on xtal_p
6: low reference on xtal_p</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_CTRL_REG</name>
	<description>Xtal32m control register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000415</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>XTAL32M_DRIVE_CYCLES</name>
	<description>Number of drive clock-cycles
0x0: Drive disabled
0x1: 4
0x2: 8
0x3: 16
0x4: 32
0x5: 64
0x6:128
0x7:256</description>
	<bitRange>[11:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_ENABLE</name>
	<description>Enables xtal32m (testing purposes)</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_BIASPROT</name>
	<description>Bias startup circuit
0: enable during startup
1: always enabled
2: always disabled</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_LDO_SAH</name>
	<description>Controls amplitude regulator sample-and-hold
2'b00: set to HOLD when IRQ fires
2'b01: always TRACK
2'b1x: always HOLD</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_AMPREG_SAH</name>
	<description>Controls amplitude regulator sample-and-hold
2'b00: set to HOLD when IRQ fires
2'b01: always TRACK
2'b1x: always HOLD</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_BIAS_SAH</name>
	<description>Controls bias sample-and-hold
2'b00: set to HOLD when IRQ fires
2'b01: always TRACK
2'b1x: always HOLD</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_FSM_REG</name>
	<description>Startup state machine configuration</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>XTAL32M_BOOST_MODE</name>
	<description>Boost mode configuration
0: Only allow BOOST mode in START state
1: Allow BOOST mode in SETTLE and START state</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_FSM_APPLY_CONFIG</name>
	<description>CUR_SET, AMPL_SET, CMP_LVL and TRIM from XTAL32M_TRIM_REG are
0: applied at next startup
1: immediately applied</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_FSM_FORCE_IDLE</name>
	<description>Forces FSM in IDLE state, allows for software control</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CMP_MODE</name>
	<description>Use following comparator trim settings in SETTLE state:
0: XTAL32M_TRIM_REG.CMP_LVL
1: XTAL32M_SETTLE_REG.CMP_LVL</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_TRIM_MODE</name>
	<description>Use following trimsetting in the SETTLE state
0: XTAL32M_TRIM_REG.TRIM
1: XTAL32M_SETTLE_REG.TRIM</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CUR_MODE</name>
	<description>Use the following current setting in the SETTLE state
0: XTAL32M_START_REG.CUR_SET
1: XTAL32M_SETTLE_REG.CUR_SET</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_IRQ_CTRL_REG</name>
	<description>Xtal32m Interrupt control register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000008ff</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>XTAL32M_IRQ_CAP_CTRL</name>
	<description>The IRQ counter is captured in the XTAL32M_IRQ_STATUS_REG.IRQ_COUNT_CAP when leaving the following state
0: START
1: SETTLE
2: RUN</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_IRQ_ENABLE</name>
	<description>Enable xtal interrupt generation.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_IRQ_CLK</name>
	<description>Clock divider for IRQ counter
0: 4us
1: 32us</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_IRQ_CNT</name>
	<description>IRQ counter start value.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_IRQ_STAT_REG</name>
	<description>XTAL32M IRQ status register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>XTAL32M_IRQ_COUNT_CAP</name>
	<description>Captured IRQ counter</description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_IRQ_COUNT_STAT</name>
	<description>Current IRQ counter value</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>XTAL32M_SETTLE_REG</name>
	<description>Trim values for XTAL32M in SETTLE state of startup</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x001a312c</resetValue>
	<resetMask>0x1fffffff</resetMask>
	<fields><field>
	<name>XTAL32M_TIMEOUT</name>
	<description>Timeout
0: disabled
1: 4us
2: 8us

