nguyentri/da-pac/svd/DA1470x.svd
	<registers>
	<register>
	<name>DCACHE_BASE_ADDR_REG</name>
	<description>Dcache base address for cacheable region</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0001ffff</resetMask>
	<fields><field>
	<name>DCACHE_BASE_ADDR</name>
	<description>Base of PSRAM cacheable memory
N*1kByte. N = 0 to 131072 (max. of 128 MByte).</description>
	<bitRange>[16:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCACHE_CTRL_REG</name>
	<description>Dcache Control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00800000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DCACHE_DISABLE_CLKGATE</name>
	<description>Disable the clockgating for the DCACHE
0: Enable clockgating (default)
1: Disable clockgating</description>
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCACHE_WBUFFER_FLUSH</name>
	<description>Write buffer flush
0: Write buffer isn't flushed (default)
1: Write buffer is flushed</description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCACHE_WBUFFER_EMPTY</name>
	<description>Status of the write buffer
0: Write buffer isn't empty
1: Write buffer is empty</description>
	<bitRange>[23:23]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCACHE_WFLUSHED</name>
	<description>0: DCACHE is not write flushed yet.
1: DCACHE is write flushed.

Note 1: Setting and clearing of this (status) bit field is automatically done by the hardware.
Note 2: The CACHE_WFLUSHED bit can also be cleared first by the software by writing a '0'</description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCACHE_READY</name>
	<description>0: DCACHE isn't initialized yet
1: DCACHE initialization has been completed</description>
	<bitRange>[21:21]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCACHE_WFLUSH</name>
	<description>Write a '1' to this field will trigger a write flush of the 'dirty' lines. All modified data in 'dirty' line will be written back to the PSRAM. The corresponding 'dirty' bits will be cleared. Reading this bit will return '0'</description>
	<bitRange>[20:20]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DCACHE_INIT</name>
	<description>Write a '1' to this field will trigger an initialization of the cache ('0's are written in the TAG area).. Reading from this field will always return '0'</description>
	<bitRange>[19:19]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DCACHE_ENABLE</name>
	<description>Enable the dcache controller HW block:
0: Disabled, all AHB accesses towards the QSPI are bypassing the HW block straight into the PSRAM
1: Enabled, all AHB access towards the QSPI within the cacheable region are cached.</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCACHE_LEN</name>
	<description>Length of PSRAM cacheable memory
N*1kByte. N = 0 to 131072 (max. of 128 MByte).
Setting DCACHE_LEN=0 disables the caching.</description>
	<bitRange>[17:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCACHE_MRM_CTRL_REG</name>
	<description>Dcache MRM (Miss Rate Monitor) CONTROL register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MRM_IRQ_EVICTS_THRES_STATUS</name>
	<description>0: No interrupt is generated.
1: Interrupt (pulse-sensitive) is generated because the number of cache evicts reached the programmed threshold (threshold != 0).</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MRM_IRQ_HITS_THRES_STATUS</name>
	<description>0: No interrupt is generated.
1: Interrupt (pulse-sensitive) is generated because the number of cache hits reached the programmed threshold (threshold != 0).</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MRM_IRQ_MISSES_THRES_STATUS</name>
	<description>0: No interrupt is generated.
1: Interrupt (pulse-sensitive) is generated because the number of cache misses reached the programmed threshold (threshold != 0).</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MRM_IRQ_TINT_STATUS</name>
	<description>0: No interrupt is generated.
1: Interrupt (pulse-sensitive) is generated because the time interval counter reached the end (time interval != 0).</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MRM_IRQ_MASK</name>
	<description>0: Disables interrupt generation.
1: Enables interrupt generation.
Note: The Cache MRM generates a pulse-sensitive interrupt towards the ARM processor,</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MRM_START</name>
	<description>0: Freeze the &quot;misses/hits&quot; counters and reset the time interval counter to the programmed value in CACHE_MRM_TINT_REG.
1: Enables the counters.
Note: In case CACHE_MRM_CTRL_REG[MRM_START] is set to '1' and CACHE_MRM_TINT_REG (!=0) is used for the MRM interrupt generation, the time interval counter counts down (on a fixed reference clock of 16 MHz) until it's '0'. At that time CACHE_MRM_CTRL_REG[MRM_START] will be reset automatically to '0' by the MRM hardware and the MRM interrupt will be generated.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCACHE_MRM_EVICTS_REG</name>
	<description>Dcache MRM (Miss Rate Monitor) EVICTS register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MRM_EVICTS</name>
	<description>Contains the amount of cache evicts</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCACHE_MRM_EVICTS_THRES_REG</name>
	<description>Dcache MRM (Miss Rate Monitor) EVICTS THRESHOLD register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MRM_EVICTS_THRES</name>
	<description>Defines the hits threshold to trigger the interrupt generation. See also the description of CACHE_MRM_CTRL_REG[MRM_IRQ_EVICTS_THRES_STATUS].
Note: When MRM_EVICTS_THRES=0 (unrealistic value), no interrupt will be generated.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCACHE_MRM_HITS_REG</name>
	<description>Dcache MRM (Miss Rate Monitor) HITS register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MRM_HITS</name>
	<description>Contains the amount of cache hits.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCACHE_MRM_HITS_THRES_REG</name>
	<description>Dcache MRM (Miss Rate Monitor) HITS THRESHOLD register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MRM_HITS_THRES</name>
	<description>Defines the hits threshold to trigger the interrupt generation. See also the description of CACHE_MRM_CTRL_REG[MRM_IRQ_HITS_THRES_STATUS].
Note: When MRM_HITS_THRES=0 (unrealistic value), no interrupt will be generated.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCACHE_MRM_MISSES_REG</name>
	<description>Dcache MRM (Miss Rate Monitor) MISSES register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MRM_MISSES</name>
	<description>Contains the amount of cache misses.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCACHE_MRM_MISSES_THRES_REG</name>
	<description>Dcache MRM (Miss Rate Monitor) THRESHOLD register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MRM_MISSES_THRES</name>
	<description>Defines the misses threshold to trigger the interrupt generation. See also the description of CACHE_MRM_CTRL_REG[MRM_IRQ_MISSES_THRES_STATUS].
Note: When MRM_MISSES_THRES=0 (unrealistic value), no interrupt will be generated.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCACHE_MRM_TINT_REG</name>
	<description>Dcache MRM (Miss Rate Monitor) TIME INTERVAL register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MRM_TINT</name>
	<description>Defines the time interval for the monitoring in 32 MHz clock cycles. See also the description of CACHE_MRM_CTRL_REG[MRM_IRQ_TINT_STATUS].
Note: When MRM_TINT=0 (unrealistic value), no interrupt will be generated.</description>
	<bitRange>[18:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DCDC</name>
	<version>1.0</version>
	<description>DCDC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000300</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>4</size>
	<usage>registers</usage>
</addressBlock>
	
