nguyentri/da-pac/svd/DA1470x.svd
	<registers>
	<register>
	<name>BUCK_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00008cc0</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CFG_TIMEOUT</name>
	<description>Sets maximum switch on-time.
0x0: Disabled
0x1: 0.5 ms
0x2: 1.0 ms (Default)
0x3: 1.5 ms</description>
	<bitRange>[15:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EN_FREEWHEEL</name>
	<description>Enables freewheel switch when converter is idle.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRIM_BIAS</name>
	<description>Bias current trim.
0x0: -21 %
0x1: -14 %
0x2: -7 %
0x3: +0 % (Default)
0x4: +7 %
0x5: +14 %
0x6: +21 %
0x7: +28 %</description>
	<bitRange>[12:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CFG_IMAX_UPPER</name>
	<description>Sets upper value of inductor peak current limit control.
0x0: 260 mA
0x1: 400 mA
0x2: 530 mA
0x3: 660 mA
0x4: 790 mA
0x5: 920 mA
0x6: 1060 mA (Default)
0x7: 1190 mA</description>
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CFG_IMAX_LOWER</name>
	<description>Sets lower value of inductor peak current limit control.
0x0: 260 mA (Default)
0x1: 400 mA
0x2: 530 mA
0x3: 660 mA
0x4: 790 mA
0x5: 920 mA
0x6: 1060 mA
0x7: 1190 mA</description>
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CFG_HYST</name>
	<description>Controls hysteresis on output comparator. Values listed are typical.
0x0: 6 mV (Default)
0x1: 9 mV
0x2: 12 mV
0x3: 15 mV</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DCDC_BOOST</name>
	<version>1.0</version>
	<description>DCDC_BOOST registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000500</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>24</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>BOOST_CTRL_REG0</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00090d2c</resetValue>
	<resetMask>0x001fffff</resetMask>
	<fields><field>
	<name>BOOST_TIMEOUT_TRIG_DELAY</name>
	<description>Delay before generating next comparator clock after a timeout event on the P switch, allows inductor current to drop to zero
0x0: Disabled
0x1: 250 ns
0x2: 500 ns
0x3: 750 ns
0x4: 1000 ns (default)
0x5: 1250 ns
0x6: 1500 ns
0x7: 1750 ns
0x8: 2000 ns
0x9: 2250 ns
0xA: 2500 ns
0xB: 2750 ns
0xC: 3000 ns
0xD: 3250 ns
0xE: 3500 ns
0xF: 3750 ns</description>
	<bitRange>[20:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_PSW_TIMEOUT</name>
	<description>P switch timeout, if switch is closed longer than this a timeout is generated and the FSM is forced to the next state
0x0: Disabled
0x1: 250 ns
0x2: 500 ns
0x3: 750 ns
0x4: 1000 ns
0x5: 1250 ns
0x6: 1500 ns
0x7: 1750 ns
0x8: 2000 ns (default)
0x9: 2250 ns
0xA: 2500 ns
0xB: 2750 ns
0xC: 3000 ns
0xD: 3250 ns
0xE: 3500 ns
0xF: 3750 ns</description>
	<bitRange>[16:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_NSW_TIMEOUT</name>
	<description>N switch timeout, if switch is closed longer than this a timeout is generated and the FSM is forced to the next state
0x0: Disabled
0x1: 125 ns
0x2: 250 ns
0x3: 375 ns
0x4: 500 ns
0x5: 625 ns
0x6: 750 ns (default)
0x7: 875 ns
0x8: 1000 ns
0x9: 1125 ns
0xA: 1250 ns
0xB: 1375 ns
0xC: 1500 ns
0xD: 1625 ns
0xE: 1750 ns
0xF: 1875 ms</description>
	<bitRange>[12:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_OK_CLR_COUNT</name>
	<description>Number of subsequent V_NOK events before BOOST_VLED_OK is reset
0x0: 2
0x1: 4
0x2: 8 (default)
0x3: 15</description>
	<bitRange>[8:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_IDLE_CLK_DIV</name>
	<description>Determines times between comparator samples when converter is idle
0x0 = 250 ns
0x1 = 500 ns (default)
0x2 = 1000 ns
0x3 = 2000 ns</description>
	<bitRange>[6:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_VLED_TRIM</name>
	<description>Trim setting for boost converter, sets deviation from nominal output voltage (4 V)
0x0: -75 mV
0x1: -50 mV
0x2: -25 mV
0x3: 0 mV (default)
0x4: 25 mV
0x5: 50 mV
0x6: 75 mV
0x7: 100 mV</description>
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_VLED_SEL</name>
	<description>Voltage selection for boost converter, sets nominal output voltage
0x0: 4.50V (default)
0x1: 4.75V
0x2: 5.00V
0x3: 5.00V</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BOOST_CTRL_REG1</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0003fbe4</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>BOOST_CUR_LIM_SLEEP_FIXED</name>
	<description>Enable fixed current iso dynamic current in sleep mode
0x0: Use dynamic current control
0x1: Use fixed current as defined in BOOST_CUR_LIM_SLEEP (default)</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_CUR_LIM_SLEEP</name>
	<description>Fixed inductor peak current limit in sleep mode
I = 30 mA * (1 + N), default 960 mA</description>
	<bitRange>[16:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_CUR_LIM_STEP</name>
	<description>Step size taken by automatic inductor peak current limit control
0x0: 0 (disabled)
0x1: 1
0x2: 2 (default)
0x3: 3</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_CUR_LIM_MAX</name>
	<description>Maximum inductor peak current limit
I = 30 mA * (1 + N), default 960 mA</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_CUR_LIM_MIN</name>
	<description>Minimum inductor peak current limit
I = 30 mA * (1 + N), default 150 mA</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BOOST_STATUS_REG</name>
	
