nguyentri/da-pac/svd/DA1470x.svd
	<registers>
	<register>
	<name>DSI2_CFG_AUTOINSERT_EOTP_REG</name>
	
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>AUTOINSERT_EOTP</name>
	<description>Enables the Host Controller to automatically insert an EoTp short packet when switching from HS to LP mode.
1b0 eotp is not automatically inserted
1b1 eotp is automatically inserted</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_BTA_H_TO_COUNT_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>BTA_H_TO_COUNT</name>
	<description>Host Bust Turn Around (BTA) Timout. Sets the value of the DSI-2 Host Bus Turn Around timeout in clk clock periods that once reached will initiate a timeout error. A value of 0x000000 disables the timeout.</description>
	<bitRange>[23:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_CLK_LANE_EN_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>CLK_LANE_EN</name>
	<description>Forces PHY Enable n signals to 1'b1 when register is set to 1. See the DSI-2
Controller User Guide description of the input port cfg clk lane en for additional information.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_CONTINUOUS_HS_CLK_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>CONTINUOUS_HS_CLK</name>
	<description>Sets the Host Controller into non-continuous MIPI clock mode. When in
non-continuous clock mode, the high speed clock will transistion into low power mode between
transmissions. 1'b0 - Non-Continuous high speed clock 1'b1 - Continuous high speed clock</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_DATA_LANE_EN_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>DATA_LANE_EN</name>
	<description>Forces PHY Enable n signals to 1'b1 when register is set to 1. See the DSI-2
Controller User Guide description of the input port cfg data lane en for additional informa-
tion.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_DISABLE_BURST_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>DISABLE_BURST</name>
	<description>Disables packets combined into a burst. Normal DSI-2 operation is to combine packets and send as a burst without returning to LP mode between each packet.
1b0 packets are combined and sent as a burst. (Default DSI-2 behavior)
1b1 Controller returns to LP mode between each packet.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_DISBL_RX_CRC_CHECK_REG</name>
	
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>DISABLE_RX_CRC_CHECK</name>
	<description>Prevents the Host from checking the payload CRC in long packets sent from the Peripheral. This input should be set if the peripheral does not support CRC generation.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_EXT_CMDS_AFT_EOTP_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>EXTRA_CMDS_AFTER_EOTP</name>
	<description>Configures the DSI-2 Host Controller to send extra End Of Transmission Packets after the end of a packet. The value of cfg_extra_cmd_after_eotp is the number of extra EOTP packets sent.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_HTX_TO_COUNT_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>HTX_TO_COUNT</name>
	<description>Host HS TX Timeout count, HS TX Timeout. Sets the value of the DSI-2 host High Speed TX timeout count in clk clock periods that once reached will initiate a timeout error and follow the recovery procedure documented in the DSI-2 specification. A value of 0x000000 disables the timeout.</description>
	<bitRange>[23:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_IRQ_MASK</name>
	<description>Status of APB to packet interface, reading will clear IRQ status 1 and 2</description>
	<addressOffset>0x000001a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>IRQ_HS_TX_TIMEOUT</name>
	<description>host bta timeout, host controller host bta timeout port</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_LP_RX_TIMEOUT</name>
	<description>low power rx timeout, host controller lp rx timeout port</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_HOST_BTA_TIMEOUT</name>
	<description>high speed tx timeout, host controller hs tx timeout port</description>
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_MAP_DIRECTORY</name>
	<description>map directory to dsi host controller status out port bit descriptions</description>
	<bitRange>[28:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_RX_PACKET_RCVD</name>
	<description>All RX packet payload data has been received</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_RX_HEADER_RCVD</name>
	<description>RX packet header has been received</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_RX_FIFO_UNDERFLOW</name>
	<description>RX fifo underflow</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_RX_FIFO_OVERFLOW</name>
	<description>RX fifo overflow</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_TX_FIFO_UNDERFLOW</name>
	<description>TX fifo underflow</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_TX_FIFO_OVERFLOW</name>
	<description>TX fifo overflow</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_DPHY_DIRECTION</name>
	<description>DPHY direction
0 - TX had control
1 - RX has control</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_TX_DONE</name>
	<description>TX packet done</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_STATE_NOT_IDLE</name>
	<description>State machine not idle</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_IRQ_MASK2</name>
	<description>Status of APB to packet interface part 2, read part 2 first then dsi2 host irq 2</description>
	<addressOffset>0x000001ac</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>IRQ_CRC_ERROR</name>
	<description>CRC error</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_MULTI_BIT_ECC_ERROR</name>
	<description>TX packet done</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_SINGLE_BIT_ECC_ERROR</name>
	<description>Single bit ecc error</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_IRQ_STATUS</name>
	<description>Status of APB to packet interface, reading will clear IRQ status 1 and 2</description>
	<addressOffset>0x000001a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>IRQ_HS_TX_TIMEOUT</name>
	<description>host bta timeout, host controller host bta timeout port</description>
	<bitRange>[31:31]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_LP_RX_TIMEOUT</name>
	<description>low power rx timeout, host controller lp rx timeout port</description>
	<bitRange>[30:30]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_HOST_BTA_TIMEOUT</name>
	<description>high speed tx timeout, host controller hs tx timeout port</description>
	<bitRange>[29:29]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_MAP_DIRECTORY</name>
	<description>map directory to dsi host controller status out port bit descriptions</description>
	<bitRange>[28:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_RX_PACKET_RCVD</name>
	<description>All RX packet payload data has been received</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_RX_HEADER_RCVD</name>
	<description>RX packet header has been received</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_RX_FIFO_UNDERFLOW</name>
	<description>RX fifo underflow</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_RX_FIFO_OVERFLOW</name>
	<description>RX fifo overflow</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_TX_FIFO_UNDERFLOW</name>
	<description>TX fifo underflow</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_TX_FIFO_OVERFLOW</name>
	<description>TX fifo overflow</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_DPHY_DIRECTION</name>
	<description>DPHY direction
0 - TX had control
1 - RX has control</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_TX_DONE</name>
	<description>TX packet done</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_STATE_NOT_IDLE</name>
	<description>State machine not idle</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_IRQ_STATUS2</name>
	<description>Status of APB to packet interface part 2, read part 2 first then dsi2 host irq 2</description>
	<addressOffset>0x000001a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>IRQ_CRC_ERROR</name>
	<description>CRC error</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_MULTI_BIT_ECC_ERROR</name>
	<description>TX packet done</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_SINGLE_BIT_ECC_ERROR</name>
	<description>Single bit ecc error</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_LRX_H_TO_COUNT_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>LRX_H_TO_COUNT</name>
	<description>Host Low Power RX Timeout, LP_RX-H Timeout. Sets the value of the DSI-2 Low Power RX timeout count in clk clock periods that once reached will initiate a timeout error and follow the recovery procedure documented in the DSI-2 specification. A value of 0x000000 disables the timeout.</description>
	<bitRange>[23:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_NUM_LANES_REG</name>
	<description>configure numer of active lanes</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>NUM_LANES</name>
	<description>Sets the number of active lanes that are to be used for transmitting data. 4'b0000
- No active lanes (reset default)
4'b0001 - 1 Active Lanes
4'b0010 - 2 Active Lanes
4'b0011 - 3 Active Lanes (not supported)
4'b0100 - 4 Active Lanes (not supported)</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_PACKET_CONTROL</name>
	<description>Tx packet control register</description>
	<addressOffset>0x00000184</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x07ffffff</resetMask>
	<fields><field>
	<name>PKT_BTA_ONLY</name>
	<description>Perform BTA only, no packet tx</description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PKT_BTA_AFTER_SENT</name>
	<description>Perform BTA after packet is sent</description>
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PKT_LP_OR_HS</name>
	<description>low power or high speed</description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PKT_HEADER_DTYPE</name>
	<description>Packet header DSI Data Type</description>
	<bitRange>[23:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PKT_VC</name>
	<description>Virtual channel</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PKT_WC</name>
	<description>Packet word count</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_PKT_RD_LEVEL</name>
	<description>Read level of APB to pkt interface fifo</description>
	<addressOffset>0x00000194</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PKT_FIFO_RD_LEVEL</name>
	<description>Read level of APB to pkt interface fifo</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_PKT_RX_HEADER</name>
	<description>Packet 2 APB RX header</description>
	<addressOffset>0x0000019c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>PKT_RX_HEADER_DTYPE</name>
	<description>Packet header DSI Data Type</description>
	<bitRange>[23:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PKT_RX_VC</name>
	<description>Virtual channel</description>
	<bitRange>[17:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PKT_RX_WC</name>
	<description>Packet word count</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_PKT_RX_PAYLOAD</name>
	<description>Packet 2 APB RX payload</description>
	<addressOffset>0x00000198</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PKT_PKT_RX_PAYLOAD</name>
	<description>APB to pkt interface RX payload read</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_PKT_STATUS</name>
	<description>Status of APB to packet interface</description>
	<addressOffset>0x0000018c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>PKT_RX_PACKET_RCVD</name>
	<description>All RX packet payload data has been received</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PKT_RX_HEADER_RCVD</name>
	<description>RX packet header has been received</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PKT_RX_FIFO_UNDERFLOW</name>
	<description>RX fifo underflow</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PKT_RX_FIFO_OVERFLOW</name>
	<description>RX fifo overflow</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PKT_TX_FIFO_UNDERFLOW</name>
	<description>TX fifo underflow</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PKT_TX_FIFO_OVERFLOW</name>
	<description>TX fifo overflow</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PKT_DPHY_DIRECTION</name>
	<description>DPHY direction
0 - TX had control
1 - RX has control</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PKT_TX_DONE</name>
	<description>TX packet done</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PKT_STATE_NOT_IDLE</name>
	<description>State machine not idle</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_PKT_WR_LEVEL</name>
	<description>Write level of APB to pkt interface fifo</description>
	<addressOffset>0x00000190</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PKT_FIFO_WR_LEVEL</name>
	<description>Write level of APB to pkt interface fifo</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_RX_ERROR_STATUS_REG</name>
	
