nguyentri/da-pac/svd/DA1470x.svd
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007fb</resetMask>
	<fields><field>
	<name>BTA_TIMEOUT</name>
	<description>BTA timeout</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>REV_LP_DATA_RX_TIMEOUT</name>
	<description>Reverse Low Power Data receive timeout</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HS_FWD_TX_TIMEOUT</name>
	<description>High Speed forward TX timeout</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CRC_ERR</name>
	<description>CRC error</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_SINGLE_BIT_ERR_POS</name>
	<description>Bit position for ECC single bit error</description>
	<bitRange>[6:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_MULTI_BIT_ERR</name>
	<description>ECC multi bit error</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_SINGLE_BIT_ERR</name>
	<description>ECC single bit error</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_SEND_PACKET</name>
	<description>Tx send packet</description>
	<addressOffset>0x00000188</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>CFG_SEND_PACKET</name>
	<description>Tx send packet, writing to this register causes the packet described in dsi2 host
pkt control to be sent.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_STATUS_OUT_REG</name>
	<description>Contains the status of the status register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LAST_RCVD_TRIGGER</name>
	<description>Last received Trigger. Current status of the RxTriggerEsc[3:0] from the TX DPHY. Each bit represents one of the possible 4 trigger values was received but unfortunately the MIPI DPHY spec does not define with RxTriggerEsc bit represents which trigger value so the value will be DPHY provider dependent. For Mixel DPHYs the values are as follows:
4b0001 reset trigger ( 01100010 )
4b0010 unknown trigger 3 ( 01011101 )
4b0100 unknown trigger 4 ( 00100001 )
4b1000 unknown trigger 5 ( 10100000 )</description>
	<bitRange>[19:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DSI2_PROT_VIOLATION</name>
	<description>Protocol violation error from peripheral error report, cleared upon read</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>INVALID_TRANS_LENGTH</name>
	<description>Transmission length error from peripheral error report, cleared upon read</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DSI2_VC_ID_INVALID</name>
	<description>Invalid VC from peripheral error report, cleared upon read</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DSI2_DT_NOT_RECOGNIZED</name>
	<description>Invalid data type from peripheral error report, cleared upon read</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LP_CHECKSUM_ERROR</name>
	<description>Checksum error (long packet only) from peripheral error report, cleared upon read</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_MULTI_BIT_ERROR</name>
	<description>ECC multi-bit error from peripheral error report (not corrected), cleared upon read</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_1BIT_ERROR</name>
	<description>ECC single bit error from peripheral error report (and corrected), cleared upon read</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CONTENTION_DETECTED</name>
	<description>Contention Detection from peripheral error report, cleared upon read</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FALSE_CTRL_ERROR</name>
	<description>False Control Error from peripheral error report, cleared upon read</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PERIPH_TIMEOUT_ERROR</name>
	<description>Peripheral Timeout error from peripheral error report, cleared upon read</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LP_TRANS_SYNC_ERROR</name>
	<description>Low Power Transmit Sync error from peripheral error report, cleared upon read</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ESC_MODE_ENTRY_CMD_ERROR</name>
	<description>Escape Mode Entry Command Error from peripheral error report, cleared upon read</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EOT_SYNC_ERROR</name>
	<description>End of Transmission Sync Error from peripheral error report, cleared upon read</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SOT_SYNC_ERROR</name>
	<description>Start of Transmission Sync Error from peripheral error report, cleared upon read</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SOT_ERROR</name>
	<description>Start of Transmission Error from peripheral error report, cleared upon read</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_TWAKEUP_REG</name>
	
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0007ffff</resetMask>
	<fields><field>
	<name>TWAKEUP</name>
	<description>PHY Twakeup timing parameter. Sets the number of clk_esc clock periods to keep a clock or data lane in Mark-1 state after exiting ULPS. The MIPI PHY spec (D-PHY and C-PHY) requires a minimum of 1ms in Mark-1 state after leaving ULPS.

Because each lane requires a wakeup timer, the default hardware configuration ignores the lower 8 bits to reduce logic and area. This gives a timer resolution of 256 esc clocks. If higher resolution is required, the controller can be delivered with full 19 bit support at the expense of extra logic and area.</description>
	<bitRange>[18:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_TX_GAP_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>TX_GAP</name>
	<description>Sets the number of byte clock periods (clk input) that the controller will wait after the clock lane has been put into LP mode before enabling the clock lane for HS mode again.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_TX_PAYLOAD</name>
	<description>TX Payload data write register</description>
	<addressOffset>0x00000180</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CFG_TX_PAYLOAD</name>
	<description>Tx Payload data write register. Writes to this registers load the payload fo with
32 bit values.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_T_POST_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>T_POST</name>
	<description>Sets the number of byte clock periods (clk input) to wait before putting the clock lane into LP mode after the data lanes have been put into LP mode.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_T_PRE_REG</name>
	
