nguyentri/da-pac/svd/DA1470x.svd
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>T_PRE</name>
	<description>Sets the number of byte clock periods (clk input) that the controller will wait after enabling the clock lane for HS operation before enabling the data lanes for HS operation.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_BLLP_MODE</name>
	
	<addressOffset>0x00000140</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>VID_BLLP_MODE</name>
	<description>Optimize bllp periods to Low Power mode when possible
0 blanking packets are sent during BLLP periods
1 LP mode is used for BLLP periods</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_ENABLE</name>
	
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>VID_ENABLE</name>
	<description>Enables the video interface
0 = video interface off; all packets go through rx packet interface
1 = video interface on; video packets routed out video interface</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_HBP</name>
	
	<addressOffset>0x0000012c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VID_HBP</name>
	<description>Sets the DSI-2 packet payload size, in bytes, of the horizontal back porch blanking packet. This input is ignored if cfg_vid_override = 1b0.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_HFP</name>
	
	<addressOffset>0x00000128</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VID_HFP</name>
	<description>Sets the DSI-2 packet payload size, in bytes, of the horizontal front porch blanking packet. This input is ignored if cfg_vid_override = 1b0.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_HSA</name>
	
	<addressOffset>0x00000130</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VID_HSA</name>
	<description>Sets the DSI-2 packet payload size, in bytes, of the horizontal sync width filler blanking packet. This input is ignored if cfg_vid_override = 1b0.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_HSYNC_POLARITY</name>
	
	<addressOffset>0x00000118</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>VID_HSYNC_POLARITY</name>
	<description>Sets Polarity of vid_hsync input, 0 active low, 1 active high</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_OVERRIDE</name>
	
	<addressOffset>0x00000120</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>VID_OVERRIDE</name>
	<description>Overrides internal counters and uses values on configuration inputs.
1b0 Sync timing parameters are calculated off video input.
1b1 Sync timing parameters are set by cfg_vid_* configuration signals.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_PACKETS_P_LINE</name>
	
	<addressOffset>0x00000134</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>VID_PACKETS_P_LINE</name>
	<description>Sets the number of packets that will be sent for a video line. Default reset value is 3d1. Currently, only the default is supported:
3b001 Video Line is sent in a single packet</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_PIX_ALIGNMENT</name>
	
	<addressOffset>0x0000010c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>VID_PIX_ALIGNMENT</name>
	<description>Some RGB modes can be aligned either MSB or LSB onto the video_pX[35:0] inputs. See section DSI2 spec 4.9.5 for assignments.
0 LSB alignment
1 MSB alignment</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_PIX_FORMAT</name>
	
	<addressOffset>0x00000110</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>VID_PIX_FORMAT</name>
	<description>Sets the DSI-2 packet type of the pixels. Value is the actual data type sent across the MIPI interface.
0x0B Compressed Pixel Stream, 32-bit or 64-bit
0x0C - Loosely Packed Pixel Stream, 20-bit YCbCr, 4:2:2
0x1C - Packed Pixel Stream, 24-bit YCbCr, 4:2:2 format
0x2C - Packed Pixel Stream, 16-bit YCbCr, 4:2:2 format
0x0D - Packed Pixel Stream, 30-bit RGB, 10-10-10 format
0x1D - Packed Pixel Stream, 36-bit RGB, 12-12-12 format
0x3D - Packed Pixel Stream, 12-bit YCbCr, 4:2:0 format
0x0E - Packed Pixel Stream, 16-bit RGB, 5-6-5 format
0x1E - Packed Pixel Stream, 18-bit RGB, 6-6-6
0x2E - Loosely Packed Pixel Stream, 18-bit RGB, 6-6-6
0x3E - Packed Pixel Stream, 24-bit RGB, 8-8-8</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_PIX_PAYLOAD_SIZE</name>
	
