nguyentri/da-pac/svd/DA1470x.svd
	<addressOffset>0x00000108</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VID_PIX_PAYLOAD_SIZE</name>
	<description>The number of bytes in a video payload packet. Normally this can be set to zero and let the payload size to be calculated based on cfg_vid_pixels_packet. However, in cases like DSC operation where the number of bytes may not be a multiple of 32 or 64, cfg_vid_pixel_payload_size should be set to reflect the total number of bytes to be sent.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_PIX_P_PACKET</name>
	
	<addressOffset>0x00000104</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VID_PIX_P_PACKET</name>
	<description>Sets the number of pixels that are sent in a packet for each video line. If cfg_vid_packets_per_line is set to 3d1, cfg_vid_pixels_per_packet would be set to the total pixels for each video line. If cfg_vid_packets_per_line is set to 2d2, then this should be set to half the number of pixels on a video line.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_START_DELAY</name>
	
	<addressOffset>0x00000124</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VID_START_DELAY</name>
	<description>In order to optimize DSI-2 utility, the video interface buffers a certain number of pixels before initiating a DSI-2 packet. This configuration port controls the number of clk clock cycles to wait before requesting the DSI-2 Host Controller to start sending data.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_USE_NULL_PKT_BLLP</name>
	
	<addressOffset>0x00000144</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>VID_USE_NULL_PKT_BLLP</name>
	<description>Selects type of blanking packet to be sent during bllp region
0 - Blanking packet used in bllp region
1 - Null packet used in bllp region</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_VACTIVE</name>
	
	<addressOffset>0x00000148</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VID_VACTIVE</name>
	<description>Sets the number of lines in the vertical active area. This input is ignored if cfg_vid_override = 1b0.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_VBP</name>
	
	<addressOffset>0x00000138</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VID_VBP</name>
	<description>Sets the number of lines in the vertical back porch. This input is ignored if cfg_vid_override = 1b0.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_VC</name>
	
	<addressOffset>0x0000014c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>VID_VC</name>
	<description>Sets the Virtual Channel (VC) of packets that will be sent to the receive packet interface. Unless cfg_disable_vc_check is set, packets with VC not equal to this value are discarded and the &quot;DSI-2 VC ID Invalid&quot; bit (bit 12) in the DSI-2 error report is set.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_VFP</name>
	
	<addressOffset>0x0000013c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VID_VFP</name>
	<description>Sets the number of lines in the vertical front porch. This input is ignored if cfg_vid_override = 1b0.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_VIDEO_MODE</name>
	
	<addressOffset>0x0000011c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>VID_VID_VIDEO_MODE</name>
	<description>Select DSI-2 video mode that the host VID module should generate packets for.
2b00 Non-Burst mode with Sync Pulses
2b01 Non-Burst mode with Sync Events
2b10 Burst Mode
2b11 Reserved, not valid</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_CFG_VID_VSYNC_POLARITY</name>
	
	<addressOffset>0x00000114</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>VID_VSYNC_POLARITY</name>
	<description>Sets polarity of vid_vsync input, 0 active low, 1 active high</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DSIDPHY_REG</name>
	<version>1.0</version>
	<description>DSIDPHY_REG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x51001500</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>56</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>DPHY_BIST_DC_OUT_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>DPHY_BIST_DC_OUT</name>
	<description>Output signal used in the DC test modes.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DPHY_BIST_ENBL_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>DPHY_BIST_ENBL</name>
	<description>Six-bit signal that enables the testing modes
[000000] Testing Disabled
[000001] HS-TX Sequence Test (1)
[000010] HS-TX Sequence Test (2)
[000011] HS-TX Sequence PRBS Test (1)
[000100] HS-TX Sequence PRBS Test (2)
[001001] HS-TX Test (1)
[001010] HS-TX Test (2)
[001011] HS-TX PRBS Test (1)
[001100] HS-TX PRBS Test (2)
[001101] HS-TX SDI Test
[010000] LP-TX LPDT Test
[010001] LP-TX DC Test
[010011] LP-RX DC Tests
[010100] LP-CD DC Tests</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DPHY_BIST_PATTERN_REG</name>
	
