nguyentri/da-pac/svd/DA1470x.svd
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DPHY_BIST_PATTERN</name>
	<description>This is the programmable test pattern used by BIST pattern generator and pattern matcher. The TEST_PATTERN bus value will be used as the payload data during the test, the HS SYNC token shouldnt be part of the TEST_PATTERN</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DPHY_CLK_DATA_LANE_PROG_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00c30608</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>UC_PRG_HS_TRAIL</name>
	<description>Clock Lane: Bits used to program T_CLK_TRAIL time in the end of high speed transmission mode</description>
	<bitRange>[25:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UC_PRG_HS_ZERO</name>
	<description>Clock Lane: Bits used to program T_CLK_ZERO time in the beginning of high speed transmission mode.</description>
	<bitRange>[20:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UC_PRG_HS_PREPARE</name>
	<description>Clock Lane: Bit used to program T_CLK_PREPARE time in the beginning of high speed transmission mode.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>U_PRG_HS_TRAIL</name>
	<description>Data Lane: Bits used to program T_HS_TRAIL time in the end of high speed transmission mode</description>
	<bitRange>[12:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>U_PRG_HS_ZERO</name>
	<description>Data Lane: Bits used to program T_HS_ZERO time in the beginning of high speed transmission mode.</description>
	<bitRange>[7:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>U_PRG_HS_PREPARE</name>
	<description>Data Lane: Bits used to program T_HS_PREPARE time in the beginning of high speed transmission mode</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DPHY_GLOBAL_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000037</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>ULPS_PLL_CTRL</name>
	<description>When the PHY enters ULPS, this input determines if the PLL will be powered down or not.
1b0: Feature disabled
1b1: Feature enabled [Default]</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ULPS_PHY_CTRL</name>
	<description>When the PHY enters ULPS, this input determines if the PHY will be powered down or not.
1b0: Feature disabled
1b1: Feature enabled [Default]</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LOCK_BYP</name>
	<description>When clock lane exits from ULPS, this input determines if the PLL LOCK signal will be used to gate the TxByteClkHS
1b0: PLL LOCK signal will gate TxByteClkHS clock [Default]
1b1: PLL LOCK signal will not gate TxByteClkHS clock, CIL based counter will be used to gate the TxByteClkHS</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AUTO_PD_EN</name>
	<description>Powers down inactive lanes reported by CFG_NUM_LANES input bus.
1b0: inactive lanes are powered up and driving LP11.
1b1: inactive lanes are powered down [Default]</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHY_PD</name>
	<description>Power Down input for PHY. When high, all blocks are powered down</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_PD</name>
	<description>Power-down signal When high, the PLL is powered down</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DPHY_PLL_CONTROL_REG</name>
	<description>PLL control</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0004f7fd</resetValue>
	<resetMask>0x001fffff</resetMask>
	<fields><field>
	<name>PLL_LOCK_LATCH</name>
	<description>Enable signal to use latched LOCK signal
1b0: LOCK&lt;= Normal LOCK signal [Default]
1b1: LOCK&lt;= Latched LOCK signal</description>
	<bitRange>[20:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_BYPASS</name>
	<description>Enable signal to bypass PLL:
1b0: CLKOUT&lt;= CLKREF * ( M / ( N * O ))
1b1: CLKOUT&lt;= CLKEXT</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_TST</name>
	<description>Test Pins. Should be connected to chip configuration registers.
4'b1001: TST_PLL [Default] at normal operation</description>
	<bitRange>[18:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_CM</name>
	<description>Control M (feedback) divider</description>
	<bitRange>[14:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_CN</name>
	<description>Control N (input) divider</description>
	<bitRange>[6:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_CO</name>
	<description>Control O (output) divider</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DPHY_STATUS_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>PLL_LOCK</name>
	<description>Lock Detect output. Asserted when PLL is frequency locked</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DPHY_TX_RCAL_REG</name>
	<description>On-chip termination control</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_RCAL</name>
	<description>On-chip termination control bits for manual calibration of HS-TX. Only active when BYPASS_RCAL asserted.
1b0: 20% higher than mid-range. Highest impedance setting.
1b1: Mid-range impedance setting.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_DPHY_CLK_RST_N_CTRL_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>DPHY_TX_ESC_CLK_DIV</name>
	<description>0: div/4, required with RCHS of 64MHz
1: div/6, required with RCHS of 92MHz
</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DSI2_RESET_N</name>
	<description>Hold the DSI2 in reset. This should be set to 'b0 when configuring the DSI2 to avoid metastability</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_ERROR_STATUS_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>ROW_ACCESS_ERROR</name>
	<description>There was a row access error in the memory. A read and a write took place at the same cycle. Reason could be that the FIFO was almost full</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HOST_BTA_TIMEOUT</name>
	<description>Host BTA timeout has occurred.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LS_RX_TIMEOUT</name>
	<description>Low Power RX timeout has occurred</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HS_TX_TIMEOUT</name>
	<description>High Speed transmit has timed out.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CRC_ERROR</name>
	<description>CRC calculated on the received data does not match the CRC the transmitter sent at the end of the packet.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ECC_TWO_BIT_ERROR</name>
	<description>Single bit error in the packet header was detected and corrected.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ECC_ONE_BIT_ERROR</name>
	<description>Two packet header bit errors were detected and not corrected</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VID_ERROR_BLANKING</name>
	<description>Only asserted if cfg_vid_video_mode is set to Burst Mode and cfg_vid_bllp_mode is set to 1b1. Asserted if not enough blanking time between end of a video line and the next vid_hsync. If video line transmission to the controller is occurring when a new vid_hsync is detected, this error signal will be asserted. This may indicate that VID_CLK is too fast, or that the cfg_vid_* parameters are incorrectly set.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VID_ERROR_FIFO_UNDERFLOW</name>
	<description>Asserted if internal video FIFO underflows. The video rate might be lower than the MIPI rate. This may indicate that VID_CLK is too slow, or that the cfg_vid_* parameters are incorrectly set.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VID_ERROR_FIFO_OVERFLOW</name>
	<description>Asserted if internal video FIFO overflows. The video rate might be higher than the MIPI rate or the delay for MIPI is long enough that the FIFO overflows. This may indicate that VID_CLK is too fast, or that the cfg_vid_* parameters are incorrectly set.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VID_ERROR_SYNC_PULSE</name>
	<description>Only asserted if cfg_vid_video_mode is set to Non-Burst mode with Sync Pulses. New vid_hsync was detected while still sending blanking from last video line. This can occur if video rate is set to higher than MIPI rate and there is not enough cycles to transmit the video blanking after transmitting the video line. This may indicate that VID_CLK is too fast, or that the cfg_vid_* parameters are incorrectly set.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VID_ERROR</name>
	<description>Asserted if an error occurs during operation. Signal is asserted if any of the other vid_error signals (sync_pulse, fifo_overflow, fifo_underflow, or blanking) are asserted. Signal can be used as an enable to latch the other vid_error signals.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_INTERRUPT_EN_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>ROW_ACCESS_ERROR_IRQ_EN</name>
	<description>Enable Row Access Error IRQ</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HOST_BTA_TIMEOUT_IRQ_EN</name>
	<description>Enable BTA timeout IRQ</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LP_RX_TIMEOUT_IRQ_EN</name>
	<description>Enable Low Power RX timeout IRQ</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HS_TX_TIMEOUT_IRQ_EN</name>
	<description>Enable High Speed TX timeout IRQ</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CRC_ERROR_IRQ_EN</name>
	<description>Enable CRC error IRQ</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ECC_TWO_BIT_ERROR_IRQ_EN</name>
	<description>Enable ECC 2 bit error IRQ</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ECC_ONE_BIT_ERROR_IRQ_EN</name>
	<description>Enable ECC 1 bit error IRQ</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VID_ERROR_BLANKING_IRQ_EN</name>
	<description>Enable VID blanking error IRQ</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VID_ERROR_FIFO_UNDERFLOW_IRQ_EN</name>
	<description>Enable VID FIFO underflow IRQ</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VID_ERROR_FIFO_OVERFLOW_IRQ_EN</name>
	<description>Enable VID FIFO overflow IRQ</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VID_ERROR_SYNC_PULSE_IRQ_EN</name>
	<description>Enable VID sync pulse error IRQ</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VID_ERROR_IRQ_EN</name>
	<description>Enable VID error IRQ</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_MEMCTRL_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>DSI2_MS</name>
	
	<bitRange>[4:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DSI2_MSE</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DSI2_TRIGGER_REG</name>
	
