nguyentri/da-pac/svd/DA1470x.svd
Values:
0x0 (OFF): LED off
0x1 (ON): LED on</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_HOST_CTRL2_R_REG</name>
	<description>This register is used to control how the Host Controller operates. This register is applicable for an SD/eMMC/UHS-II mode.</description>
	<addressOffset>0x0000003e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PRESET_VAL_ENABLE</name>
	<description>Preset Value Enable
This bit enables automatic selection of SDCLK frequency and Driver strength Preset Value registers. When Preset Value Enable is set, SDCLK frequency generation (Frequency Select and Clock Generator
Select) and the driver strength selection are performed by the controller. These values are selected from set of Preset Value registers based on selected speed mode.
Note: For more information, see the FAQ on Preset Register in the DWC_mshc Databook.
Values:
0x0 (FALSE): SDCLK and Driver Strength are controlled by Host Driver
0x1 (TRUE): Automatic Selection by Preset Value are Enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ASYNC_INT_ENABLE</name>
	<description>Asynchronous Interrupt Enable
This bit can be set if a card supports asynchronous interrupts and Asynchronous Interrupt Support is set to 1 in the Capabilities register.
Values:
0x0 (FALSE): Disabled
0x1 (TRUE): Enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADDRESSING</name>
	<description>64-bit Addressing
This bit is effective when Host Version 4 Enable is set to 1.
Values:
0x0 (FALSE): 32 bits addressing
0x1 (TRUE): 64 bits addressing</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HOST_VER4_ENABLE</name>
	<description>Host Version 4 Enable
This bit selects either Version 3.00 compatible mode or Version 4 mode.
Functions of following fields are modified for Host Version 4 mode:
- SDMA Address: SDMA uses ADMA System Address (05Fh-058h) instead of SDMA System Address register (003h-000h)
- ADMA2/ADMA3 selection: ADMA3 is selected by DMA select in Host Control 1 register
- 64-bit ADMA Descriptor Size: 128-bit descriptor is used instead of 96-bit descriptor when 64-bit Addressing is set to 1
- Selection of 32-bit/64-bit System Addressing: Either 32-bit or 64-bit system addressing is selected by 64-bit Addressing bit in this register
- 32-bit Block Count: SDMA System Address register (003h-000h) is modified to 32-bit Block Count register
Note: It is recommended not to program ADMA3 Integrated Descriptor Address registers, UHS-II registers and Command Queuing registers (if applicable) while operating in Host version less than 4 mode (Host Version 4 Enable = 0).
Values:
0x0 (FALSE): Version 3.00 compatible mode
0x1 (TRUE): Version 4 mode</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD23_ENABLE</name>
	<description>CMD23 Enable
If the card supports CMD23, this bit is set to 1. This bit is used to select Auto CMD23 or Auto CMD12 for ADMA3 data transfer.
Values:
0x0 (FALSE): Auto CMD23 is disabled
0x1 (TRUE): Auto CMD23 is enabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADMA2_LEN_MODE</name>
	<description>ADMA2 Length Mode
This bit selects ADMA2 Length mode to be either 16-bit or 26-bit.
Values:
0x0 (FALSE): 16-bit Data Length Mode
0x1 (TRUE): 26-bit Data Length Mode</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UHS2_IF_ENABLE</name>
	<description>UHS-II Interface Enable
This bit is used to enable the UHS-II Interface. The value is reflected on the uhs2_if_en pin.
Values:
0x0 (FALSE): SD/eMMC Interface Enabled
0x1 (TRUE): UHS-II Interface Enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SAMPLE_CLK_SEL</name>
	<description>Sampling Clock Select
This bit is used by the Host Controller to select the sampling clock in SD/eMMC mode to receive CMD and DAT. This bit is set by the tuning procedure and is valid after the completion of tuning (when Execute Tuning is cleared). Setting this bit to 1 means that tuning is completed successfully and setting this bit to 0 means that tuning has failed. The value is reflected on the sample_cclk_sel pin.
Values:
0x0 (FALSE): Fixed clock is used to sample data
0x1 (TRUE): Tuned clock is used to sample data</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EXEC_TUNING</name>
	<description>Execute Tuning
This bit is set to 1 to start the tuning procedure in UHS-I/eMMC speed modes and this bit is automatically cleared when tuning procedure is completed.
Values:
0x0 (FALSE): Not Tuned or Tuning completed
0x1 (TRUE): Execute Tuning</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DRV_STRENGTH_SEL</name>
	<description>Driver Strength Select
This bit is used to select the Host Controller output driver in 1.8V signaling UHS-I/eMMC speed modes. The bit depends on setting of Preset Value Enable. The value is reflected on the uhs1_drv_sth pin.
Values:
0x0 (TYPEB): Driver TYPEB is selected
0x1 (TYPEA): Driver TYPEA is selected
0x2 (TYPEC): Driver TYPEC is selected
0x3 (TYPED): Driver TYPED is selected</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIGNALING_EN</name>
	<description>1.8V Signaling Enable
This bit controls voltage regulator for I/O cell in UHS-I/eMMC speed modes. Setting this bit from 0 to 1 starts changing the signal voltage from 3.3V to 1.8V. Host Controller clears this bit if switching to 1.8 signaling
fails. The value is reflected on the uhs1_swvolt_en pin.
Note: This bit must be set for all UHS-I speed modes (SDR12/SDR25/SDR50/SDR104/DDR50).
Values:
0x0 (V_3_3): 3.3V Signalling
0x1 (V_1_8): 1.8V Signalling</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UHS_MODE_SEL</name>
	<description>UHS Mode/eMMC Speed Mode Select
These bits are used to select UHS mode in the SD mode of operation. In eMMC mode, these bits are used to select eMMC Speed mode.
UHS Mode (SD/UHS-II mode only):
- 0x0: SDR12
- 0x1: SDR25
- 0x2: SDR50
- 0x3: SDR104
- 0x4: DDR50
- 0x5: Reserved
- 0x6: Reserved
- 0x7: UHS-II
eMMC Speed Mode (eMMC mode only):
- 0x0: Legacy
- 0x1: High Speed SDR
- 0x2: Reserved
- 0x3: HS200
- 0x4: High Speed DDR
- 0x5: Reserved
- 0x6: Reserved
- 0x7: HS400
Values:
0x0 (SDR12): SDR12/Legacy
0x1 (SDR25): SDR25/High Speed SDR
0x2 (SDR50): SDR50
0x3 (SDR104): SDR104/HS200
0x4 (DDR50): DDR50/High Speed DDR
0x5 (RSVD5): Reserved
0x6 (RSVD6): Reserved
0x7 (UHS2): UHS-II/HS400</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_MBIU_CTRL_R_REG</name>
	<description>This register is used to select the valid burst types that the AHB Master bus interface can generate. &#13;
When more than one bit </description>
	<addressOffset>0x00000510</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x0000000e</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>BURST_INCR16_EN</name>
	<description>INCR16 Burst
Controls generation of INCR16 transfers on Master interface.
Values:
0x0 (FALSE): AHB INCR16 burst type is not generated on Master I/F
0x1 (TRUE): AHB INCR16 burst type can be generated on Master I/F</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BURST_INCR8_EN</name>
	<description>INCR8 Burst
Controls generation of INCR8 transfers on Master interface.
Values:
0x0 (FALSE): AHB INCR8 burst type is not generated on Master I/F
0x1 (TRUE): AHB INCR8 burst type can be generated on Master I/F</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BURST_INCR4_EN</name>
	<description>INCR4 Burst
Controls generation of INCR4 transfers on Master interface.
Values:
0x0 (FALSE): AHB INCR4 burst type is not generated on Master I/F
0x1 (TRUE): AHB INCR4 burst type can be generated on Master I/F</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UNDEFL_INCR_EN</name>
	<description>Undefined INCR Burst
Controls generation of undefined length INCR transfer on Master interface.
Values:
0x0 (FALSE): Undefined INCR type burst is the least preferred burst on AHB Master I/F
0x1 (TRUE): Undefined INCR type burst is the most preferred burst on AHB Master I/F</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_MSHC_CTRL_R_REG</name>
	<description>This register is used to control the operation of MSHC Host Controller.</description>
	<addressOffset>0x00000508</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>SW_CG_DIS</name>
	<description>Internal clock gating disable control
This bit must be used to disable IP's internal clock gating when required. when disabled clocks are not gated. Clocks to the core (except hclk) must be stopped when programming this bit.
Values:
0x0 (ENABLE): Internal clock gates are active and clock gating is controlled internally
0x1 (DISABLE): Internal clock gating is disabled, clocks are not gated internally</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_CONFLICT_CHECK</name>
	<description>Command conflict check
This bit enables command conflict check.
Note: DWC_mshc controller monitors the CMD line whenever a command is issued and checks whether the value driven on sd_cmd_out matches the value on sd_cmd_in at next subsequent edge
of cclk_tx to determine command conflict error. This bit is cleared only if the feed back delay (including IO Pad delay) is more than (t_card_clk_period - t_setup), where t_setup is the setup time of
a flop in DWC_mshc. The I/O pad delay is consistent across CMD and DATA lines, and it is within the value:
(2*t_card_clk_period - t_setup)  
Values:
0x0 (DISABLE_CMD_CONFLICT_CHK): Disable command conflict check
0x1 (CMD_CONFLICT_CHK_LAT1): Check for command conflict after 1 card clock cycle</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_MSHC_VER_ID_R_REG</name>
	<description>This register reflects the current release number of DWC_mshc/DWC_mshc_lite.</description>
	<addressOffset>0x00000500</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x3138302a</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MSHC_VER_ID</name>
	<description>Current release number
This field indicates the Synopsys DesignWare Cores DWC_mshc/DWC_mshc_lite current release number that is read by an application.
An application reading this register in conjunction with the MSHC_VER_TYPE_R register, gathers details of the current release.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_MSHC_VER_TYPE_R_REG</name>
	<description>This register reflects the current release type of DWC_mshc/DWC_mshc_lite.</description>
	<addressOffset>0x00000504</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x67612a2a</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MSHC_VER_TYPE</name>
	<description>Current release type
This field indicates the Synopsys DesignWare Cores DWC_mshc/DWC_mshc_lite current release type that is read by an application.
An application reading this register in conjunction with the MSHC_VER_ID_R register, gathers details of the current release.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_NORMAL_INT_SIGNAL_EN_R_REG</name>
	<description>This register is used to select the interrupt status that is indicated to the Host System as the interrupt. All these status bi</description>
	<addressOffset>0x00000038</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CQE_EVENT_SIGNAL_EN</name>
	<description>Command Queuing Engine Event Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FX_EVENT_SIGNAL_EN</name>
	<description>FX Event Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RE_TUNE_EVENT_SIGNAL_EN</name>
	<description>Re-Tuning Event (UHS-I only) Signal Enable.
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_C_SIGNAL_EN</name>
	<description>INT_C (Embedded) Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_B_SIGNAL_EN</name>
	<description>INT_B (Embedded) Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_A_SIGNAL_EN</name>
	<description>INT_A (Embedded) Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_INTERRUPT_SIGNAL_EN</name>
	<description>Card Interrupt Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_REMOVAL_SIGNAL_EN</name>
	<description>Card Removal Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_INSERTION_SIGNAL_EN</name>
	<description>Card Insertion Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUF_RD_READY_SIGNAL_EN</name>
	<description>Buffer Read Ready Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUF_WR_READY_SIGNAL_EN</name>
	<description>Buffer Write Ready Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_INTERRUPT_SIGNAL_EN</name>
	<description>DMA Interrupt Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BGAP_EVENT_SIGNAL_EN</name>
	<description>Block Gap Event Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XFER_COMPLETE_SIGNAL_EN</name>
	<description>Transfer Complete Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_COMPLETE_SIGNAL_EN</name>
	<description>Command Complete Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_NORMAL_INT_STAT_EN_R_REG</name>
	<description>This register enables the Interrupt Status for Normal Interrupt Status register (NORMAL_INT_STAT_R) when NORMAL_INT_STAT_R is s</description>
	<addressOffset>0x00000034</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CQE_EVENT_STAT_EN</name>
	<description>CQE Event Status Enable

Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FX_EVENT_STAT_EN</name>
	<description>FX Event Status Enable
This bit is added from Version 4.10.

Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RE_TUNE_EVENT_STAT_EN</name>
	<description>Re-Tuning Event (UHS-I only) Status Enable

Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_C_STAT_EN</name>
	<description>INT_C (Embedded) Status Enable

