nguyentri/da-pac/svd/DA1470x.svd
Values:
0x0 (FALSE): Not in DORMANT state
0x1 (TRUE): In DORMANT state
</description>
	<bitRange>[29:29]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SUB_CMD_STAT</name>
	<description>Sub Command Status.
This bit is used to distinguish between a main command and a sub command status.

Values:
0x0 (FALSE): Main Command Status
0x1 (TRUE): Sub Command Status
</description>
	<bitRange>[28:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_ISSUE_ERR</name>
	<description>Command Not Issued by Error.
This bit is set if a command cannot be issued after setting the command register due to an error except the Auto CMD12 error.

Values:
0x0 (FALSE): No error for issuing a command
0x1 (TRUE): Command cannot be issued
</description>
	<bitRange>[27:27]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HOST_REG_VOL</name>
	<description>Host Regulator Voltage Stable.
This bit is used to check whether the host regulator voltage is stable for switching the voltage of UHS-I mode. This bit reflects the synchronized value of the host_reg_vol_stable signal.

Values:
Description
0x0 (FALSE): Host Regulator Voltage is not stable
0x1 (TRUE): Host Regulator Voltage is stable
</description>
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_LINE_LVL</name>
	<description>Command-Line Signal Level.
This bit is used to check the CMD line level to recover from errors and for debugging. These bits reflect the value of the sd_cmd_in signal.</description>
	<bitRange>[24:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DAT_3_0</name>
	<description>DAT[3:0] Line Signal Level.
This bit is used to check the DAT line level to recover from errors and for debugging. These bits reflect the value of the sd_dat_in (lower nibble) signal. </description>
	<bitRange>[23:20]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>WR_PROTECT_SW_LVL</name>
	<description>Write Protect Switch Pin Level.
This bit is supported only for memory and combo cards. This bit reflects the synchronized value of the card_write_prot signal.

Values:
0x0 (FALSE): Write protected
0x1 (TRUE): Write enabled</description>
	<bitRange>[19:19]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CARD_DETECT_PIN_LEVEL</name>
	<description>Card Detect Pin Level.
This bit reflects the inverse synchronized value of the card_detect_n signal.

Values:
0x0 (FALSE): No card present
0x1 (TRUE): Card Present</description>
	<bitRange>[18:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CARD_STABLE</name>
	<description>Card Stable.
This bit indicates the stability of the Card Detect Pin Level. A card is not detected if this bit is set to 1 and the value of the CARD_INSERTED bit is 0.

Values:
0x0 (FALSE): Reset or Debouncing
0x1 (TRUE): No Card or Inserted</description>
	<bitRange>[17:17]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CARD_INSERTED</name>
	<description>Card Inserted.
This bit indicates whether a card has been inserted. The Host Controller debounces this signal so that Host Driver need not wait for it to stabilize.

Values:
0x0 (FALSE): Reset, Debouncing, or No card
0x1 (TRUE): Card Inserted</description>
	<bitRange>[16:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUF_RD_ENABLE</name>
	<description>Buffer Read Enable.
This bit is used for non-DMA transfers. This bit is set if valid data exists in the Host buffer.

Values:
0x0 (DISABLED): Read disable
0x1 (ENABLED): Read enable</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUF_WR_ENABLE</name>
	<description>Buffer Write Enable.
This bit is used for non-DMA transfers. This bit is set if space is available for writing data.

Values:
0x0 (DISABLED): Write disable
0x1 (ENABLED): Write enable</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RD_XFER_ACTIVE</name>
	<description>Read Transfer Active.
This bit indicates whether a read transfer is active for SD/eMMC mode.

Values:
0x0 (INACTIVE): No valid data
0x1 (ACTIVE): Transferring data</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>WR_XFER_ACTIVE</name>
	<description>Write Transfer Active.
This status indicates whether a write transfer is active  for SD/eMMC mode.

Values:
0x0 (INACTIVE): No valid data
0x1 (ACTIVE): Transferring data</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DAT_7_4</name>
	<description>DAT[7:4] Line Signal Level.
This bit is used to check the DAT line level to recover from errors and for debugging. These bits reflect the value of the sd_dat_in (upper nibble) signal.</description>
	<bitRange>[7:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RE_TUNE_REQ</name>
	<description>Re-Tuning Request.
DWC_mshc does not generate retuning request. The software must maintain the Retuning timer. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DAT_LINE_ACTIVE</name>
	<description>DAT Line Active (SD/eMMC Mode only).
This bit indicates whether one of the DAT lines on the SD/eMMC bus is in use.
In the case of read transactions, this bit indicates whether a read transfer is executing on the SD/eMMC bus.
In the case of write transactions, this bit indicates whether a write transfer is executing on the SD/eMMC bus.
For a command with busy, this status indicates whether the command executing busy is executing on an SD or eMMC bus.

Values:
0x0 (INACTIVE): DAT Line Inactive
0x1 (ACTIVE): DAT Line Active</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_INHIBIT_DAT</name>
	<description>Command Inhibit (DAT).
This bit is applicable for SD/eMMC mode and is generated if either DAT line active or Read transfer active is set to 1.
If this bit is set to 0, it indicates that the Host Controller can issue subsequent SD/eMMC commands.

Values:
0x0 (READY): Can issue command which used DAT line
0x1 (NOT_READY): Cannot issue command which used
DAT line</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_INHIBIT</name>
	<description>Command Inhibit (CMD).
This bit indicates the following :
- SD/eMMC mode: If this bit is set to 0, it indicates that the CMD line is not in use and the Host controller can issue an SD/eMMC command using the CMD line. This bit is set when the command register is written. This bit is cleared when the command response is received. This bit is not cleared by the response of auto CMD12/23 but cleared by the response of read/write command.

Values:
0x0 (READY): Host Controller is ready to issue a command
0x1 (NOT_READY): Host Controller is not ready to issue a command</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PWR_CTRL_R_REG</name>
	<description>This register is used to control the bus power for the Card. This register is applicable for an SD, eMMC, and UHS-II modes.</description>
	<addressOffset>0x00000029</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SD_BUS_VOL_VDD2</name>
	<description>SD Bus Voltage Select for VDD2.
This is irrelevant for SD/eMMC card.

Values:
0x7 (NOT_USED7): Not used
0x6 (NOT_USED6): Not used
0x5 (V_1_8): 1.8V
0x4 (V_1_2): Reserved for 1.2V
0x3 (RSVD3): Reserved
0x2 (RSVD2): Reserved
0x1 (RSVD1): Reserved
0x0 (NO_VDD2): VDD2 Not Supported</description>
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SD_BUS_PWR_VDD2</name>
	<description>SD Bus Power for VDD2.
This is irrelevant for SD/eMMC card.

Values:
0x0 (OFF): Power off
0x1 (ON): Power on</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SD_BUS_VOL_VDD1</name>
	<description>SD Bus Voltage Select for VDD1/eMMC Bus Voltage Select for VDD.
These bits enable the Host Driver to select the voltage level for an SD/eMMC card. Before setting this register, the Host Driver checks the Voltage Support bits in the Capabilities register.
If an unsupported voltage is selected, the Host System does not supply the SD Bus voltage. The value set in this field is available on the DWC_mshc output signal (sd_vdd1_sel), which is used by the voltage switching circuitry.
SD Bus Voltage Select options:
- 0x7 : 3.3V(Typical)
- 0x6 : 3.0V(Typical)
- 0x5 : 1.8V(Typical) for Embedded
- 0x4 : 0x0   - Reserved
eMMC Bus Voltage Select options:
- 0x7 : 3.3V(Typical)
- 0x6 : 1.8V(Typical)
- 0x5 : 1.2V(Typical)
- 0x4 : 0x0   - Reserved

Values:
0x7 (V_3_3): 3.3V (Typ.)
0x6 (V_3_0): 3.0V (Typ.)
0x5 (V_1_8): 1.8V (Typ.) for Embedded
0x4 (RSVD4): Reserved
0x3 (RSVD3): Reserved
0x2 (RSVD2): Reserved
0x1 (RSVD1): Reserved
0x0 (RSVD0): Reserved</description>
	<bitRange>[3:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SD_BUS_PWR_VDD1</name>
	<description>SD Bus Power for VDD1.
This bit enables VDD1 power of the card. This setting is available on the sd_vdd1_on output of DWC_mshc so that it can be used to control the VDD1 power supply of the card. Before setting this bit, the SD Host Driver sets the SD Bus Voltage Select bit. If the Host Controller detects a No Card state, this bit is cleared.
In SD mode, if this bit is cleared, the Host Controller stops the SD Clock by clearing the SD_CLK_IN bit in the CLK_CTRL_R register.

Values:
0x0 (OFF): Power off
0x1 (ON): Power on</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_P_EMBEDDED_CNTRL_REG</name>
	<description>This register points to the location of UHS-II embedded control registers.</description>
	<addressOffset>0x000000e6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000f6c</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>REG_OFFSET_EMBEDDED_CNTRL_ADDR</name>
	<description>Offset Address of Embedded Control register.            
</description>
	<bitRange>[11:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_P_VENDOR_SPECIFIC_AREA_REG</name>
	<description>This register used as a pointer for the Vendor Specific Area 1.</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000500</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>REG_OFFSET_ADDR_VENDOR</name>
	<description>Base offset Address for Vendor-Specific registers.            
</description>
	<bitRange>[11:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_P_VNDR2_SPECIFIC_AREA_REG</name>
	<description>This register is used as a pointer for the Vendor Specific Area 2.</description>
	<addressOffset>0x000000ea</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000180</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>REG_OFFSET_ADDR_VNDR2</name>
	<description>Base offset Address for Command Queuing registers.           
</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_RESP01_R_REG</name>
	<description>This register stores 39-08 bits of the Response Field for an SD/eMMC mode.  The response for an SD/eMMC command can be a maximu</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RESP01</name>
	<description>Command Response.
These bits reflect 39-8 bits of SD/eMMC Response Field.
Note: For Auto CMD, the 32-bit response (bits 39-8 of the Response Field) is updated in the RESP67_R register.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_RESP23_R_REG</name>
	<description>This register stores 71-40 bits of the Response Field for an SD/eMMC mode. This register is used to store the response from the</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RESP23</name>
	<description>Command Response.
These bits reflect 71-40 bits of the SD/eMMC Response Field. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_RESP45_R_REG</name>
	<description>This register stores 103-72 bits of the Response Field for an SD/eMMC mode.  The response for SD/eMMC command can be a maximum </description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RESP45</name>
	<description>Command Response.
These bits reflect 103-72 bits of the Response Field. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_RESP67_R_REG</name>
	<description>This register stores 135-104 bits of the Response Field for an SD/eMMC mode.    The SD/eMMC response can be a maximum of 128 bi</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RESP67</name>
	<description>Command Response.
These bits reflect bits 135-104 of SD/EMMC Response Field.
Note: For Auto CMD, this register also reflects the 32-bit response (bits 39-8 of the Response Field).</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_SDMASA_R_REG</name>
	<description>This register is used to configure a 32-bit Block Count or an SDMA System Address based on the Host Version 4 Enable bit in the</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BLOCKCNT_SDMASA</name>
	<description>32-bit Block Count (SDMA System Address).
- SDMA System Address (Host Version 4 Enable = 0): This register contains the system memory address for an SDMA transfer in the 32-bit addressing mode. When the Host Controller stops an SDMA transfer, this register points to the system address of the next contiguous data position. It can be accessed only if no transaction is executing. Reading this register during data transfers may
return an invalid value.
- 32-bit Block Count (Host Version 4 Enable = 1): From the Host Controller Version 4.10 specification, this register is redefined as 32-bit Block Count. The Host Controller decrements the block count of this register for every block transfer and the data transfer stops when the count reaches zero. This register must be accessed when no transaction is executing. Reading this register during data transfers may return invalid value.
Following are the values for BLOCKCNT_SDMASA:
- 0xFFFF_FFFF: 4G - 1 Block
- ...  
- 0x0000_0002: 2 Blocks
- 0x0000_0001: 1 Block
- 0x0000_0000: Stop Count
Note:
- For Host Version 4 Enable = 0, the Host driver does not program the system address in this register while operating in ADMA mode. The system address must be programmed in the ADMA System Address register.
- For Host Version 4 Enable = 0, the Host driver programs a non-zero 32-bit block count value in this register when Auto CMD23 is enabled for non-DMA and ADMA modes. Auto CMD23 cannot be used with SDMA.
- This register must be programmed with a non-zero value for data transfer if the 32-bit Block count register is used instead of the 16-bit Block count register.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_SLOT_INTR_STATUS_R_REG</name>
	<description>This register indicates the Interrupt status of each slot.</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>INTR_SLOT</name>
	<description>Interrupt signal for each Slot     

These status bits indicate the logical OR of Interrupt signal and Wakeup signal for each slot. A maximum of 8 slots can be defined. If one interrupt signal is associated with multiple slots, the Host
Driver can identify the interrupt that is generated by reading these bits. By a power on reset or by setting Software Reset For All bit, the interrupt signals are de-asserted and this status reads 00h.
- Bit 00: Slot 1
- Bit 01: Slot 2
- Bit 02: Slot 3
- ..........
- ..........
- Bit 07: Slot 8

