nguyentri/da-pac/svd/DA1470x.svd
Note: MSHC Host Controller support single card slot. This register shall always return 0.

</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_SW_RST_R_REG</name>
	<description>This register is used to generate a reset pulse by writing 1 to each bit of this register. After completing the reset, the Host</description>
	<addressOffset>0x0000002f</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SW_RST_DAT</name>
	<description>Software Reset For DAT line.
This bit is used in SD/eMMC mode and it resets only a part of the data circuit and the DMA circuit is also reset.
The following registers and bits are cleared by this bit:
- Buffer Data Port register
-- Buffer is cleared and initialized.  
- Present state register
-- Buffer Read Enable
-- Buffer Write Enable
-- Read Transfer Active
-- Write Transfer Active
-- DAT Line Active
-- Command Inhibit (DAT)
- Block Gap Control register
-- Continue Request 
-- Stop At Block Gap Request
- Normal Interrupt status register
-- Buffer Read Ready
-- Buffer Write Ready
-- DMA Interrupt
-- Block Gap Event
-- Transfer Complete

Values:
0x0 (FALSE): Work
0x1 (TRUE): Reset</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SW_RST_CMD</name>
	<description>Software Reset For CMD line.
This bit resets only a part of the command circuit to be able to issue a command.  This reset is effective only for a command issuing circuit (including response error statuses related to Command Inhibit (CMD) control) and does not affect the data transfer circuit. Host Controller can continue data transfer even after this reset is executed while handling subcommand-response errors.
The following registers and bits are cleared by this bit:
- Present State register : Command Inhibit (CMD) bit
- Normal Interrupt Status register : Command Complete bit
- Error Interrupt Status : Response error statuses related to Command Inhibit (CMD) bit

Values:
0x0 (FALSE): Work
0x1 (TRUE): Reset</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SW_RST_ALL</name>
	<description>Software Reset For All.
This reset affects the entire Host Controller except for the card detection circuit. During its initialization, the Host Driver sets this bit to 1 to reset the Host Controller. All registers are reset except the capabilities register. If this bit is set to 1, the Host Driver must issue reset command and reinitialize the card.

Values:
0x0 (FALSE): Work
0x1 (TRUE): Reset</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_TOUT_CTRL_R_REG</name>
	<description>This register is used to set the Data Timeout Counter value for an SD/eMMC mode according to the timer clock defined by the Cap</description>
	<addressOffset>0x0000002e</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>TOUT_CNT</name>
	<description>Data Timeout Counter Value.
This value determines the interval by which DAT line timeouts are detected. The Timeout clock frequency is generated by dividing the base clock TMCLK value by this value. When setting this
register, prevent inadvertent timeout events by clearing the Data Timeout Error Status Enable (in the Error Interrupt Status Enable register).
The values for these bits are:
- 0xF :  Reserved
- 0xE : TMCLK x 2^27
- 0x1 : TMCLK x 2^14
- 0x0 : TMCLK x 2^13
Note: During a boot operating in an eMMC mode, an application must configure the boot data timeout value (approximately 1 sec) in this bit.</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_WUP_CTRL_R_REG</name>
	<description>This register is mandatory for the Host Controller, but the wakeup functionality depends on the Host Controller system hardware</description>
	<addressOffset>0x0000002b</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>CARD_REMOVAL</name>
	<description>Wakeup Event Enable on SD Card Removal.
This bit enables wakeup event through Card Removal assertion in the Normal Interrupt Status register. For the SDIO card, Wake Up Support (FN_WUS) in the Card Information Structure (CIS) register does not affect this bit.

Values:

0x0 (DISABLED): Disable
0x1 (ENABLED): Enable
</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_INSERT</name>
	<description>Wakeup Event Enable on SD Card Insertion.
This bit enables wakeup event through Card Insertion assertion in the Normal Interrupt Status register. FN_WUS (Wake Up Support) in CIS does not affect this bit.

Values:
0x0 (DISABLED): Disable
0x1 (ENABLED): Enable</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_INT</name>
	<description>Wakeup Event Enable on Card Interrupt.
This bit enables wakeup event through a Card Interrupt assertion in the Normal Interrupt Status register. This bit can be set to 1 if FN_WUS (Wake Up Support) in CIS is set to 1.

Values:
0x0 (DISABLED): Disable
0x1 (ENABLED): Enable</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_XFER_MODE_R_REG</name>
	<description>This register is used to control the operation of data transfers for an SD/eMMC mode. The Host driver sets this register before</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESP_INT_DISABLE</name>
	<description>Response Interrupt Disable.
The Host Controller supports response check function to avoid overhead of response error check by the Host driver. Response types of only R1 and R5 can be checked by the Controller.
If Host Driver checks the response error, set this bit to 0 and wait for Command Complete Interrupt and then check
the response register.
If the Host Controller checks the response error, set this bit to 1 and set the Response Error Check Enable bit to 1. The Command Complete Interrupt is disabled by this bit
regardless of the Command Complete Signal Enable.
Note: During tuning (when the Execute Tuning bit in the Host Control2 register is set), the Command Complete Interrupt is not generated irrespective of the Response Interrupt Disable setting.

Values:
0x0 (ENABLED): Response Interrupt is enabled
0x1 (DISABLED): Response Interrupt is disabled
</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_ERR_CHK_ENABLE</name>
	<description>Response Error Check Enable.
The Host Controller supports response check function to avoid overhead of response error check by Host driver. Response types of only R1 and R5 can be checked by the Controller.
If the Host Controller checks the response error, set this bit to 1 and set Response Interrupt Disable to 1. If an error is detected, the Response Error interrupt is generated in the Error Interrupt Status register.
Note:
- Response error check must not be enabled for any response type other than R1 and R5.
- Response check must not be enabled for the tuning command.

Values:
0x0 (DISABLED): Response Error Check is disabled
0x1 (ENABLED): Response Error Check is enabled
</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_TYPE</name>
	<description>Response Type R1/R5.
This bit selects either R1 or R5 as a response type when the Response Error Check is selected.
Error statuses checked in R1:
- OUT_OF_RANGE
- ADDRESS_ERROR
- BLOCK_LEN_ERROR
- WP_VIOLATION
- CARD_IS_LOCKED
- COM_CRC_ERROR
- CARD_ECC_FAILED
- CC_ERROR
- ERROR
Response Flags checked in R5:
- COM_CRC_ERROR
- ERROR
- FUNCTION_NUMBER
- OUT_OF_RANGE

Values:
0x0 (RESP_R1): R1 (Memory)
0x1 (RESP_R5): R5 (SDIO)
</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MULTI_BLK_SEL</name>
	<description>Multi/Single Block Select.
This bit is set when issuing multiple-block transfer commands using the DAT line. If this bit is set to 0, it is not necessary to set the Block Count register.

Values:
0x0 (SINGLE): Single Block
0x1 (MULTI): Multiple Block
</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DATA_XFER_DIR</name>
	<description>Data Transfer Direction Select.
This bit defines the direction of DAT line data transfers. This bit is set to 1 by the Host Driver to transfer data
from the SD/eMMC card to the Host Controller and it is set to 0 for all other commands.

Values:
0x1 (READ): Read (Card to Host)
0x0 (WRITE): Write (Host to Card)
</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AUTO_CMD_ENABLE</name>
	<description>Auto Command Enable.
This field determines use of Auto Command functions.
Note: In SDIO, this field must be set as 00b (Auto Command Disabled).

Values:
0x0 (AUTO_CMD_DISABLED): Auto Command Disabled
0x1 (AUTO_CMD12_ENABLED): Auto CMD12 Enable
0x2 (AUTO_CMD23_ENABLED): Auto CMD23 Enable
0x3 (AUTO_CMD_AUTO_SEL): Auto CMD Auto Select
</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLOCK_COUNT_ENABLE</name>
	<description>Block Count Enable.
This bit is used to enable the Block Count register, which is relevant for multiple block transfers.
If this bit is set to 0, the Block Count register is disabled, which is useful in executing an infinite transfer. The Host Driver must set this bit to 0 when ADMA is used.

Values:
0x1 (ENABLED): Enable
0x0 (DISABLED): Disable
</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_EN_EMMC</name>
	<description>DMA Enable.
This bit enables the DMA functionality. If this bit is set to 1, a DMA operation begins when the Host Driver writes to the Command register. You can select one of the DMA modes by using DMA Select in the Host Control 1 register.

Values:
0x1 (ENABLED): DMA Data transfer
0x0 (DISABLED): No data transfer or Non-DMA data
transfer
</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GPADC</name>
	<version>1.0</version>
	<description>GPADC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50020800</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>36</size>
	<usage>registers</usage>
</addressBlock>
	
