nguyentri/da-pac/svd/DA1470x.svd
This register controls the colorization, texturing and blending units, deciding &#13;
what color a p</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>D2C_RLEFORMAT2</name>
	<description>bit1 of RLE texel format</description>
	<bitRange>[31:31]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_RLEFORMAT1</name>
	<description>bit0 of RLE texel format</description>
	<bitRange>[30:30]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BDIA</name>
	<description>dst factor for alpha channel will be inverted (meaning 1-a or 1-1 depending on BDFA)</description>
	<bitRange>[29:29]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BSIA</name>
	<description>src factor for alpha channel will be inverted (meaning 1-a or 1-1 depending on BSFA)</description>
	<bitRange>[28:28]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_CLUTFORMAT1</name>
	<description>bit0 of the CLUT entry format</description>
	<bitRange>[27:27]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_COLKEY_ENABLE</name>
	<description>enable color keying (see also &lt;D2_COLKEY&gt; and feature bits of &lt;D2_HWREVISION&gt;)</description>
	<bitRange>[26:26]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_CLUT_ENABLE</name>
	<description>enable the use of the CLUT (see also feature bits of &lt;D2_HWREVISION&gt;); if disabled the texture indices are written to FB</description>
	<bitRange>[25:25]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_RLE_ENABLE</name>
	<description>enable RLE decoder (see also feature bits of &lt;D2_HWREVISION&gt;)</description>
	<bitRange>[24:24]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEALPHA2</name>
	<description>bit1 of the 'alpha source' (depends on USE_ACB)</description>
	<bitRange>[23:23]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEALPHA1</name>
	<description>bit0 of the 'alpha source' (depends on USE_ACB)</description>
	<bitRange>[22:22]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEFORMAT2</name>
	<description>bit1 of the framebuffer format descriptor</description>
	<bitRange>[21:21]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEFORMAT1</name>
	<description>bit0 of the framebuffer format descriptor</description>
	<bitRange>[20:20]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_READFORMAT2</name>
	<description>bit1 of the texture format descriptor</description>
	<bitRange>[19:19]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_READFORMAT1</name>
	<description>bit0 of the texture format descriptor</description>
	<bitRange>[18:18]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTUREFILTERY</name>
	<description>linear filtering on texture v axis</description>
	<bitRange>[17:17]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTUREFILTERX</name>
	<description>linear filtering on texture u axis</description>
	<bitRange>[16:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTURECLAMPY</name>
	<description>clamp instead of mask v coordinate</description>
	<bitRange>[15:15]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTURECLAMPX</name>
	<description>clamp instead of mask u coordinate</description>
	<bitRange>[14:14]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BC2</name>
	<description>blending for color channels is done with &lt;D2_COLOR2&gt; instead of the real dst value</description>
	<bitRange>[13:13]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BDI</name>
	<description>dst factor for color channels will be inverted (meaning 1-a or 1-1 depending on BDF)</description>
	<bitRange>[12:12]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BSI</name>
	<description>src factor for color channels will be inverted (meaning 1-a or 1-1 depending on BSF)</description>
	<bitRange>[11:11]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BDF</name>
	<description>dst factor for color channels is alpha (factor is 1 per default)</description>
	<bitRange>[10:10]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BSF</name>
	<description>src factor for color channels is alpha (factor is 1 per default)</description>
	<bitRange>[9:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEFORMAT3</name>
	<description>bit2 of the framebuffer format descriptor</description>
	<bitRange>[8:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BDFA</name>
	<description>dst factor for alpha channel is alpha (factor is 1 per default)</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BSFA</name>
	<description>src factor for alpha channel is alpha (factor is 1 per default)</description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_READFORMAT4</name>
	<description>bit3 of the texture format descriptor</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_READFORMAT3</name>
	<description>bit2 of the texture format descriptor</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>USE_ACB</name>
	<description>use full alpha channel blending, else use write-alpha mode</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_PATTERNSOURCEL5</name>
	<description>Limiter 5 is used as pattern index instead of the default U-Limiter</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTUREENABLE</name>
	<description>Pixel source is read from texture and used as an alpha to blend between &lt;D2_COLOR1&gt; and &lt;D2_COLOR2&gt;</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_PATTERNENABLE</name>
	<description>Pixel source is a pattern color (blend of &lt;D2_COLOR1&gt; and &lt;D2_COLOR2&gt; depending on &lt;D2_PATTERN&gt; and pattern index)</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_CONTROL3</name>
	<description>#2: burst length limit control register&#13;

