nguyentri/da-pac/svd/DA1470x.svd
The start value is a 16:16 fixedpoint number valid at the first pixel of the&#13;
bounding box.</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LUSTART</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LUXADD</name>
	<description>#37: U Limiter X-Axis increment&#13;

The add value for U is the 16:16 fixedpoint difference between two samples with&#13;
a distance o</description>
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LUXADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LUYADD</name>
	<description>#38: U Limiter Y-Axis increment&#13;

The add value for U is the 16:16 fixedpoint difference between two samples with&#13;
a distance o</description>
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LUYADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LVSTARTF</name>
	<description>#40: V Limiter start value fractional part&#13;

The start value is a 32:16 fixedpoint number valid at the first pixel of the&#13;
boun</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>LVSTARTF</name>
	<description>fractional part.</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LVSTARTI</name>
	<description>#39: V Limiter start value integer part</description>
	<addressOffset>0x0000009c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LVSTARTI</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LVXADDI</name>
	<description>#41: V Limiter X-Axis increment integer part&#13;

The add value for V is the 32:16 fixedpoint difference between two samples with&#13;</description>
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LVXADDI</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LVYADDI</name>
	<description>#42: V Limiter Y-Axis increment integer part&#13;

The add value for V is the 32:16 fixedpoint difference between two samples with&#13;</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LVYADDI</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LVYXADDF</name>
	<description>#43: V Limiter X and Y increment fractional parts</description>
	<addressOffset>0x000000ac</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>D2_LVYADDI_FRAC</name>
	<description>Y increment fractional part for &lt;D2_LVYADDI&gt;.</description>
	<bitRange>[31:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2_LVXADDI_FRAC</name>
	<description>X increment fractional part for &lt;D2_LVXADDI&gt;.</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_ORIGIN</name>
	<description>#32: address of the first pixel in framebuffer&#13;

Writing to &amp;lt;D2_ORIGIN&amp;gt; will *trigger* DAVE2 to start rendering.</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>ORIGIN</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_PATTERN</name>
	<description>#29: Pattern register&#13;

Each bit in the pattern register is interpreted as a reference to one of the&#13;
two color registers ( 0bi</description>
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATTERN</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_PERFCOUNT1</name>
	<description>#51: Performance counter&#13;

Writing to the D2_PERFCOUNT1 register resets the first internal performance counter&#13;
to the specifie</description>
	<addressOffset>0x000000cc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PERFCOUNT1</name>
	
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>D2_PERFCOUNT2</name>
	<description>#52: Performance counter&#13;

Writing to the D2_PERFCOUNT2 register resets the second internal performance counter&#13;
to the specifi</description>
	<addressOffset>0x000000d0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PERFCOUNT2</name>
	
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>D2_PERFTRIGGER</name>
	<description>#53: Performance counters control register&#13;

Select the internal event that will increment &amp;lt;D2_PERFCOUNT1&amp;gt; respectively &amp;</description>
	<addressOffset>0x000000d4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PERFTRIGGER2</name>
	<description>Select the internal event that will increment D2_PERFCOUNT2 register.</description>
	<bitRange>[31:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>PERFTRIGGER1</name>
	<description>Select the internal event that will increment D2_PERFCOUNT1 register.</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_PITCH</name>
	<description>#31: framebuffer pitch and spanstore delay</description>
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SSD</name>
	<description>spanstore delay, the number of scanlines to delay spanstore operations.</description>
	<bitRange>[31:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>PITCH</name>
	<description>the width (in pixels) of one framebuffer scanline. A negative width can be used to render bottom-up instead of top-down.</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_SIZE</name>
	<description>#30: bounding box dimension</description>
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SIZEY</name>
	<description>the height (in pixels) of the primitives bounding box.</description>
	<bitRange>[31:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>SIZEX</name>
	<description>the width (in pixels) of the primitives bounding box.</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_STATUS</name>
	<description>#0: status control register&#13;

The current dave status can be polled by reading this register. It contains a &#13;
combination of th</description>
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields><field>
	<name>D2C_IRQ_BUS_ERROR_SRC</name>
	<description>source interface of bus error</description>
	<bitRange>[10:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_IRQ_BUS_ERROR</name>
	<description>IRQ on bus error</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_IRQ_DLIST</name>
	<description>IRQ on display list finish</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_IRQ_ENUM</name>
	<description>IRQ on enumeration finish</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_DLISTACTIVE</name>
	<description>display list active, cant direct access hwregs</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_CACHE_DIRTY</name>
	<description>framebuffer cache dirty, cant flip frame</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_BUSY_WRITE</name>
	<description>framebuffer writeback busy, cant change framebuffer type</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_BUSY_ENUM</name>
	<description>enumeration unit busy, cant start new primitive</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>D2_TEXCLUT</name>
	<description>#54: Color Lookup Table for the indexed texture format 16x24bit&#13;

Triggers a write into the CLUT if CLUT size is 16 x 24bit.</description>
	<addressOffset>0x000000d8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TEXCLUT_INDEX</name>
	<description>Index of the CLUT entry, that shall be written</description>
	<bitRange>[31:24]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TEXCLUT_RGB</name>
	<description>Color Value RGB888</description>
	<bitRange>[23:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_TEXCLUT_ADDR</name>
	<description>#55: Color Lookup Table write address for the indexed texture format 256x32bit&#13;

