nguyentri/da-pac/svd/DA1470x.svd
The application of the DWC_mipi_i3c can decide whether to send ACK or NACK for a Slave request received from any I3C device.

A device specific response control bit is provided to select the response option. Master will ACK/NACK the Master Request based on programming of control bit, corresponding to the interrupting device.

0 - ACK the SIR Request
1 - NACK and send directed auto disable CCC
</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_INTR_FORCE_REG</name>
	<description>Interrupt Force Enable Register </description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TRANSFER_ERR_FORCE_EN</name>
	<description>Transfer Error Force Enable</description>
	<bitRange>[9:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TRANSFER_ABORT_FORCE_EN</name>
	<description>Transfer Abort Force Enable.

This field is used only in master mode of operation.
</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>RESP_READY_FORCE_EN</name>
	<description>Response Queue Ready Force Enable</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CMD_QUEUE_READY_FORCE_EN</name>
	<description>Command Queue Ready Force Enable</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>IBI_THLD_FORCE_EN</name>
	<description>IBI Buffer Threshold Force Enable.

This field is used only in master mode of operation.
</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>RX_THLD_FORCE_EN</name>
	<description>Receive Buffer Threshold Force Enable
</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TX_THLD_FORCE_EN</name>
	<description>Transmit Buffer Threshold Force Enable.</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>I3C_INTR_SIGNAL_EN_REG</name>
	<description>Interrupt Signal Enable Register </description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TRANSFER_ERR_SIGNAL_EN</name>
	<description>Transfer Error Signal Enable</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRANSFER_ABORT_SIGNAL_EN</name>
	<description>Transfer Abort Signal Enable.

This field is used only in master mode of operation.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_READY_SIGNAL_EN</name>
	<description>Response Queue Ready Signal Enable</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_QUEUE_READY_SIGNAL_EN</name>
	<description>Command Queue Ready Signal Enable</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IBI_THLD_SIGNAL_EN</name>
	<description>IBI Buffer Threshold Signal Enable.

This field is used only in master mode of operation.
</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RX_THLD_SIGNAL_EN</name>
	<description>Receive Buffer Threshold Signal Enable
</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_THLD_SIGNAL_EN</name>
	<description>Transmit Buffer Threshold Signal Enable.

*Note: For the deassertion of the interrupt, first the *SIGNAL_EN bitfield should be cleared and then the *STATUS_EN one, otherwise is not working. This comment applies for the rest bitfields of this register </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_INTR_STATUS_EN_REG</name>
	<description>Interrupt Status Enable Register </description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TRANSFER_ERR_STS_EN</name>
	<description>Transfer Error Status Enable</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRANSFER_ABORT_STS_EN</name>
	<description>Transfer Abort Status Enable.

This field is used only in master mode of operation.
</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_READY_STS_EN</name>
	<description>Response Queue Ready Status Enable
</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_QUEUE_READY_STS_EN</name>
	<description>Command Queue Ready Status Enable
</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IBI_THLD_STS_EN</name>
	<description>IBI Buffer Threshold Status Enable.

This field is used only in master mode of operation.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RX_THLD_STS_EN</name>
	<description>Receive Buffer Threshold Status Enable</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_THLD_STS_EN</name>
	<description>Transmit Buffer Threshold Status Enable</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_INTR_STATUS_REG</name>
	<description>Interrupt Status Register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TRANSFER_ERR_STS</name>
	<description>Transfer Error Status.

This interrupt is generated if any error occurs during transfer. The error type will be specified in the response packet associated with the command (in ERR_STATUS field of RESPONSE_QUEUE_PORT register). This bit can be cleared by writing 1'b1.
</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRANSFER_ABORT_STS</name>
	<description>Transfer Abort Status.

This field is used only in master mode of operation.

This interrupt is generated if transfer is aborted. This interrupt can be cleared by writing 1'b1.
</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_READY_STS</name>
	<description>Response Queue Ready Status.

This interrupt is generated when number of entries in response queue is greater than or equal to threshold value specified by RESP_BUF_THLD field in QUEUE_THLD_CTRL register. This interrupt will be cleared automatically when number of entries in response buffer is less than threshold value specified.
</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_QUEUE_READY_STS</name>
	<description>Command Queue Ready.

This interrupt is generated when number of empty locations in command queue is greater than or equal to threshold value specified by CMD_EMPTY_BUF_THLD field in QUEUE_THLD_CTRL register. This interrupt will be cleared automatically when number of empty locations in command buffer is less than threshold value specified.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IBI_THLD_STS</name>
	<description>IBI Buffer Threshold Status.

This field is only used in master mode of operation This interrupt is generated when number of entries in IBI buffer is greater than or equal to threshold value specified by IBI_BUF_THLD field in QUEUE_THLD_CTRL register. This interrupt will be cleared automatically when number of entries in IBI buffer is less than threshold value specified.
</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RX_THLD_STS</name>
	<description>Receive Buffer Threshold Status.

This interrupt is generated when number of entries in receive buffer is greater than or equal to threshold value specified by RX_BUF_THLD field in DATA_BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when number of entries in receive buffer is less than threshold value specified.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TX_THLD_STS</name>
	<description>Transmit Buffer Threshold Status.

