nguyentri/da-pac/svd/DA1470x.svd
This interrupt is generated when number of empty locations in transmit buffer is greater than or equal to threshold value specified by TX_EMPTY_BUF_THLD field in DATA_BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when number of empty locations in transmit buffer is less than threshold value specified.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_PRESENT_STATE_REG</name>
	<description>Present State Register </description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x10000003</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MASTER_IDLE</name>
	<description>This field reflects whether the Master Controller is in Idle state or not. This bit will set when all the Queues(Command , Response, IBI) and Buffers(Transmit and Receive) are empty along with the Master State machine is in Idle state.

Values:

0x0 (MST_NOT_IDLE): Master Controller is not in IDLE State
0x1 (MST_IDLE): Master Controller is in IDLE State.
</description>
	<bitRange>[28:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_TID</name>
	<description>This field reflects the Transaction-ID of the current executing command.</description>
	<bitRange>[27:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CM_TFR_ST_STS</name>
	<description>Current Master Transfer State Status.

Indicates the state of current transfer currently executing by the DWC_mipi_i3c controller. This is valid in Master mode only.

6'h0: IDLE (Controller is Idle state, waiting for commands from application or Slave initated In-band Interrupt)
6'h1: START Generation State.
6'h2: RESTART Generation State.
6'h3: STOP Generation State.
6'h4: START Hold Generation for the Slave Initiated START State.
6'h5: Broadcast Write Address Header(7'h7E,W) Generation State.
6'h6: Broadcast Read Address Header(7'h7E,R) Generation State.
6'h7: Dynamic Address Assignment State.
6'h8: Slave Address Generation State.
6'hB: CCC Byte Generation State.
6'hC: HDR Command Generation State.
6'hD: Write Data Transfer State.
6'hE: Read Data Transfer State.
6'hF: In-Band Interrupt(SIR) Read Data State.
6'h10: In-Band Interrupt Auto-Disable State
6'h11: HDR-DDR CRC Data Generation/Receive State.
6'h12: Clock Extension State.
6'h13: Halt State.
</description>
	<bitRange>[21:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CM_TFR_STS</name>
	<description>Transfer Type Status.

Indicates the type of transfer currently executing by the DWC_mipi_i3c controller.

In Master mode of operation :

6'h0: IDLE (Controller is in Idle state, waiting for commands from application or Slave initated In-band Interrupt)
6'h1: Broadcast CCC Write Transfer.
6'h2: Directed CCC Write Transfer.
6'h3: Directed CCC Read Transfer.
6'h4: ENTDAA Address Assignment Transfer.
6'h5: SETDASA Address Assignment Transfer.
6'h6: Private I3C SDR Write Transfer.
6'h7: Private I3C SDR Read Transfer.
6'h8: Private I2C SDR Write Transfer.
6'h9: Private I2C SDR Read Transfer.
6'hA: Private HDR Ternary Symbol(TS) Write Transfer.
6'hB: Private HDR Ternary Symbol(TS) Read Transfer.
6'hC: Private HDR Double-Data Rate(DDR) Write Transfer.
6'hD: Private HDR Double-Data Rate(DDR) Read Transfer.
6'hE: Servicing In-Band Interrupt Transfer.
6'hF: Halt state (Controller is in Halt State, waiting for the application to resume through DEVICE_CTRL Register)
</description>
	<bitRange>[13:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CURRENT_MASTER</name>
	<description>This Bit is used to check whether the Master is Current Master or not. The Current Master is the Master that owns the SCL line.

If this bit is set to 0, the Master is not Current Master and requires to request and the ownership before initiating any transfer on the line.

If this bit is set to 1, the Master is the Current Master and can initate the transfers on the line.

0: Master is not Current Master
1: Master is Current Master</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SDA_LINE_SIGNAL_LEVEL</name>
	<description>This bit is used to check the SDA line level to recover from errors and for debugging. This bit reflects the value of synchronized sda_in_a signal. This is valid in Master mode only.
</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SCL_LINE_SIGNAL_LEVEL</name>
	<description>This bit is used to check the SCL line level to recover from errors and for debugging. This bit reflects the value of synchronized scl_in_a signal. This is valid in Master mode only</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_QUEUE_SIZE_CAPABILITY_REG</name>
	<description>DWC_mipi_i3c Queue Size Capability Register </description>
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00021244</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>IBI_BUF_SIZE</name>
	<description>IBI Queue Size

This field reflects the configured IBI Queue size (in DWORDS) in Encoded Values.

Values:

- 0x0 : 2 DWORDS

- 0x1 : 4 DWORDS

- 0x2 : 8 DWORDS

- 0x3 : 16 DWORDS
</description>
	<bitRange>[19:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RESP_BUF_SIZE</name>
	<description>Response Queue Size

This field reflects the configured Response Queue size (in DWORDS) in Encoded Values.

Values:

- 0x0 : 2 DWORDS

- 0x1 : 4 DWORDS

- 0x2 : 8 DWORDS

- 0x3 : 16 DWORDS</description>
	<bitRange>[15:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_BUF_SIZE</name>
	<description>Command Queue Size

This field reflects the configured Command Queue size (in DWORDS) in Encoded Values.

Values:

- 0x0 : 2 DWORDS

- 0x1 : 4 DWORDS

- 0x2 : 8 DWORDS

- 0x3 : 16 DWORDS
</description>
	<bitRange>[11:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RX_BUF_SIZE</name>
	<description>Receive Data Buffer Size

This field reflects the configured Receive Buffer size (in DWORDS) in Encoded Values.

Values:

