nguyentri/da-pac/svd/DA1470x.svd
SDR2 uses this register field for data transfer.</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I3C_EXT_LCNT_1</name>
	<description>I3C Extended Low Count Register 1

SDR1 uses this register field for data transfer.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SCL_EXT_TERMN_LCNT_TIME_REG</name>
	<description> SCL Termination Bit Low count Timing Register </description>
	<addressOffset>0x000000cc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>I3C_EXT_TERMN_LCNT</name>
	<description>I3C Read Termination Bit Low count.

Extended I3C Read Termination Bit low count for I3C Read transfers. Effective Termination-Bit Low Period is derived based on the SDR speed as shown below

SDR0 speed: I3C_PP_LCNT + I3C_EXT_TERMN_LCNT
SDR1 speed: I3C_EXT_LCNT_1 + I3C_EXT_TERMN_LCNT
SDR2 speed: I3C_EXT_LCNT_2 + I3C_EXT_TERMN_LCNT
SDR3 speed: I3C_EXT_LCNT_3 + I3C_EXT_TERMN_LCNT
SDR4 speed: I3C_EXT_LCNT_4 + I3C_EXT_TERMN_LCNT</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SCL_I2C_FMP_TIMING_REG</name>
	<description>SCL I2C Fast Mode Plus Timing Register </description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00100010</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>I2C_FMP_HCNT</name>
	<description>I2C Fast Mode Plus High Count

The SCL open-drain high count timing for I2C fast mode transfers.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_FMP_LCNT</name>
	<description>I2C Fast Mode Plus Low Count

The SCL open-drain low count timing for I2C fast mode transfers.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SCL_I2C_FM_TIMING_REG</name>
	<description>SCL I2C Fast Mode Timing Register </description>
	<addressOffset>0x000000bc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00100010</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>I2C_FM_HCNT</name>
	<description>I2C Fast Mode High Count

The SCL open-drain high count timing for I2C fast mode transfers.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_FM_LCNT</name>
	<description>I2C Fast Mode Low Count

The SCL open-drain low count timing for I2C fast mode transfers.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SCL_I3C_OD_TIMING_REG</name>
	<description>SCL I3C Open Drain Timing Register </description>
	<addressOffset>0x000000b4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000a0010</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>I3C_OD_HCNT</name>
	<description>I3C Open Drain High Count.

SCL open-drain High count (I3C) for I3C transfers targeted to I3C devices.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I3C_OD_LCNT</name>
	<description>I3C Open Drain Low Count.

SCL Open-drain low count for I3C transfers targeted to I3C devices.
</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SCL_I3C_PP_TIMING_REG</name>
	<description>SCL I3C Push Pull Timing Register</description>
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000a000a</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>I3C_PP_HCNT</name>
	<description>I3C Push Pull High Count.

SCL push-pull High count for I3C transfers targeted to I3C devices.
</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I3C_PP_LCNT</name>
	<description>I3C Push Pull Low Count.

SCL Push-pull low count for I3C transfers targeted to I3C devices.
</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SDA_HOLD_DLY_TIMING_REG</name>
	<description> SDA Hold Delay Timing Register</description>
	<addressOffset>0x000000d0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00010000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SDA_TX_HOLD</name>
	<description>This field controls the hold time (in term of the core clock period) of the transmit data (SDA) with respect to the SCL edge in FM FM+ SDR and DDR speed mode of operations. This field is not applicable for the ternary speed modes. The valid values are 1 to 7. Others are Reserved.</description>
	<bitRange>[18:16]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SLV_EVENT_STATUS_REG</name>
	<description>Slave Event Status Register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MWL_UPDATED</name>
	<description>MWL Updated Status.

This bit indicates a SETMWL CCC is received by the slave. The updated MWL value can be read from SLV_MAX_LEN register. This status can be cleared by writing 1'b1 to this field after reading the updated MWL.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MRL_UPDATED</name>
	<description>MRL Updated Status.

This bit indicates a SETMRL CCC is received by the slave. The updated MRL value can be read from SLV_MAX_LEN register. This status can be cleared by writing 1'b1 to this field after reading the updated MRL.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ACTIVITY_STATE</name>
	<description>Activity State Status.

