nguyentri/da-pac/svd/DA1470x.svd
ENTAS0 - 00

ENTAS1 - 01

ENTAS2 - 10

ENTAS3 - 11

This bit reflects the Activity State of slave set by the Master.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_VENDOR_SPECIFIC_REG_PTR_REG</name>
	<description>Pointer for Vendor specific Registers </description>
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000b0</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>P_VENDOR_REG_START_ADDR</name>
	<description>Start Address of Vendor specific registers.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_VER_ID_REG</name>
	<description>DWC_mipi_i3c Version ID Register </description>
	<addressOffset>0x000000e0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x3130302a</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>I3C_VER_ID</name>
	<description>Current release type

This field indicates the Synopsys DesignWare Cores DWC_mipi_i3c current release type that is read by an application.

For example, release type &quot;ga&quot; is represented in ASCII as 0x6761 and &quot;ea&quot; is represented as 0x6561. Lower 16 bits read from this register can be ignored by the application if release type is &quot;ga&quot;. If release type is &quot;ea&quot; the lower 16 bits represents the &quot;ea&quot; release version.

An application reading this register along with the I3C_VER_ID register, gathers details of the current release.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_VER_TYPE_REG</name>
	<description> DWC_mipi_i3c Version Type Register</description>
	<addressOffset>0x000000e4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x6c633033</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>I3C_VER_TYPE</name>
	<description>Current release type

This field indicates the Synopsys DesignWare Cores DWC_mipi_i3c current release type that is read by an application.

For example, release type &quot;ga&quot; is represented in ASCII as 0x6761 and &quot;ea&quot; is represented as 0x6561. Lower 16 bits read from this register can be ignored by the application if release type is &quot;ga&quot;. If release type is &quot;ea&quot; the lower 16 bits represents the &quot;ea&quot; release version.

An application reading this register along with the I3C_VER_ID register, gathers details of the current release.
</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>LCDC</name>
	<version>1.0</version>
	<description>LCDC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x30030000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>2048</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>LCDC_BACKPORCHXY_REG</name>
	<description>Back Porch X and Y</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BPORCH_X</name>
	<description>Back porch X (lines)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BPORCH_Y</name>
	<description>Back porch Y (pixel clocks)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_BGCOLOR_REG</name>
	<description>Background Color</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BG_RED</name>
	<description>Red color used as background.</description>
	<bitRange>[31:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BG_GREEN</name>
	<description>Green color used as background.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BG_BLUE</name>
	<description>Blue color used as background.</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BG_ALPHA</name>
	<description>Alpha color used as background.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_BLANKINGXY_REG</name>
	<description>Blanking X and Y</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BLANKING_X</name>
	<description>Blanking period X (VSYNC lines)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLANKING_Y</name>
	<description>Blanking period Y (HSYNC pulse length)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_CLKCTRL_CG_REG</name>
	<description>Controls the CLock Gaters and the routing of format and pixel clock</description>
	<addressOffset>0x000001a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LCDC_SWAP_PIX_FORMAT_CLK</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_INV_CLK_POLARITY</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_CLK_DIV_EN</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_CLKCTRL_REG</name>
	<description>Clock Divider</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000401</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SEC_CLK_DIV</name>
	<description>Secondary clock divider that generates the format pipeline clock. Source clock of this divider is the main clock of LCD controller. The period of the generated clock is defined as : (LCDC_SEC_CLK_DIV + 1) x period_of_main_clock.</description>
	<bitRange>[31:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_HOLD</name>
	<description>Hold time before DMA activated.</description>
	<bitRange>[13:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLK_DIV</name>
	<description>Clock divider that generates the pixel pipeline clock. Source clock of this divider is the format pipeline clock (see also LCDC_SEC_CLK_DIV). The period of the generated clock is defines as : LCDC_CLK_DIV x period_of_format_clk. A zero value gives division by one.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_COLMOD</name>
	<description>Color mode status register</description>
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x2070f858</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BP_DBIB</name>
	<description>Indicates that back pressure support for the DBI Type B interface is enabled</description>
	<bitRange>[31:31]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COLMODES</name>
	<description>16 bit: Indicates that the LUT8 color format is enabled
15 bit: Indicates that the RGBA5551 16-bit color format is enabled
14 bit: Indicates that the RGBA8888 32-bit color format is enabled
13 bit: Indicates that the RGB332 8-bit color format is enabled
12 bit: Indicates that the RGB565 16-bit color format is enabled
11 bit: Indicates that the ARGB8888 32-bit color format is enabled
10 bit: Indicates that the L8 color format is enabled
9 bit: Indicates that the L1 color format is enabled
8 bit: Indicates that the L4 color format is enabled
7 bit: Indicates that the YUYV color format is enabled
6 bit: Indicates that the RGB888 24-bit color format is enabled
5 bit: Indicates that the YUY2 color format is enabled
4 bit: Indicates that the ABGR8888 32-bit color format is enabled
3 bit: Indicates that the BGRA8888 32-bit color format is enabled
2 bit: Indicates that the V_YUV420 color format is enabled
1 bit: Indicates that the TLYUV420 color format is enabled
0 bit: Indicates that the TSc4/TSc6 propietary color format is enabled</description>
	<bitRange>[16:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LCDC_CONF_REG</name>
	<description>Supported config</description>
	<addressOffset>0x000000f0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00003359</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CONF</name>
	
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LCDC_CRC_REG</name>
	<description>CRC check</description>
	<addressOffset>0x00000184</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRC</name>
	<description>CRC check.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LCDC_DBIB_CFG_REG</name>
	<description>MIPI Config Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DBIB_INTERFACE_EN</name>
	<description>When set to 1, the DBI Type-B interface is activated</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_CSX_CFG_EN</name>
	<description>When set to 1, the value of the CSX signal of the DBI Type-B interface can be configured from
the DBIB_CFG[29] register bit</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_CSX_CFG</name>
	<description>Sets the value of DBIB_CSX signal:
CSX is set to one if DBIB_CFG[29] has the value of one
CSX is set to zero if DBIB_CFG[29] has the value of zero</description>
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_TE_DISABLE</name>
	<description>When set to 1, the DBIB_TE signal is disabled</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_DC_AS_SPI_SD1</name>
	<description>When set to 1, enables the usage of SPI_DC wire as SPI_SD1</description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_FORCE_IDLE</name>
	<description>When set to 1, force DBI Type-B interface to idle state. Swap on the fly data for the interface</description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_RESX_OUT_EN</name>
	<description>Drives DBIB_RESX output signal of DBI Type-B interface</description>
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SUB_PIXEL_REVERSE</name>
	<description>Reverse sub pixel order</description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI3_EN</name>
	<description>When set to 1, SPI 3-wire interface is enabled</description>
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI4_EN</name>
	<description>When set to 1, SPI 4-wire interface is enabled</description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_BACK_PRESSURE_EN</name>
	<description>When set to 1, Enables back-pressure for DBI Type-B interface</description>
	<bitRange>[21:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_CLK_PHASE</name>
	<description>Sets SPI Clock Phase</description>
	<bitRange>[20:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_CLK_POLARITY</name>
	<description>Sets SPI Clock Polarity</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPID_JDI</name>
	
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_DATA_AS_HEADER</name>
	<description>When set to 1, command data are used as header of each line</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BIT_ORDER_ADDR_INVERT</name>
	<description>When set to 1, inverts the bit-order of the horizontal line address (used along with DBIB_CFG[17]
register bit)</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_2BYTE_ADDR</name>
	<description>When set to 1, two-byte address is sent with each horizontal line (SPI)</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PIX_CLK_AT_DBIB_CLK</name>
	<description>When set to 1, expose pixel generation clock on the DBIB_CLK</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EXT_CTRL_EN</name>
	<description>When set to 1, enables the external control</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HORIZONTAL_BLANK_EN</name>
	<description>When set to 1, enables the horizontal blanking</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DUAL_SPI_SUBPIXEL_EXTRACT_EN</name>
	<description>When set to 1, Enables DualSPI sub-pixel transaction</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QUAD_SPI_EN</name>
	<description>When set to 1, Enables QuadSPI</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DUAL_SPI_EN</name>
	<description>When set to 1, Enables DualSPI</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_INTERFACE_WIDTH</name>
	<description>Set DBI Type-B interface width (8, 9 or 16 bits) and the serial interface:
0x0: 8-bit interface
0x1: 9-bit interface
0x2: 16-bit interface
0x3: SPI
0x4: Dual SPI
0x5: Quad SPI</description>
	<bitRange>[8:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_DATA_ORDER</name>
	<description>Set the data order of the 8-bit data word:
0x0: option 0
0x1: option 1
0x2: option 2
0x3: option 3
0x4: option 4
0x5: Reserved
0x6: Reserved
0x7: Reserved</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_COLOR_FMT</name>
	<description>Defines the output format and depends of the type of the output interface. For the SPI3/SPI4 are supported the following formats:
0x0 : Reserved
0x1 : RGB111
0x2 : RGB332
0x3 : RGB444
0x4 : Reserved
0x5 : RGB565
0x6 : RGB666
0x7 : RGB888</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_DBIB_CMD_REG</name>
	<description>MIPI DBIB Command Register</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PART_UPDATE</name>
	<description>When set to 0, indicates that the command data are the Base address for partial update. Applied
on SPI/JDI-SPI type</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_CMD_SEND</name>
	<description>Send command to the DBI interface</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_WIDTH</name>
	<description>Determine the command width. Applicable only on the QuadSPI
0x00: 1 Byte
0x01: 2 Bytes
0x02: 3 Bytes
0x03: Reserved</description>
	<bitRange>[29:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_CMD_STORE</name>
	<description>This bit has meaning only when LCDC_DBIB_CFG_REG[LCDC_DBIB_SPI_JDI] = 1. When is enabled, stores the LCDC_DBIB_CMD_VAL to the register that keeps the Y position. </description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RD_MODE_EN</name>
	<description>When sets to 1, read mode is enabled</description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FMTCTRL_EXPOSE_SETTING</name>
	<description>When sets to 1, FMTCTRL[15:8] is exposed on DBIB_CT pins and FMTCTRL[31] on DBIB_GE
else FMTCTRL[15:8] is exposed on DBIB_CT pins and FMTCTRL[30] on DBIB_GE</description>
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ST_INT_CMD_TYPE</name>
	<description>When sets to 1, store internally a command type which is transmitted at the beggining of each
scanline</description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_CMD_VAL</name>
	<description>Data to send to the DBI interface</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_DBIB_RDAT</name>
	<description>Data read by DBI Type-B/SPI interface</description>
	<addressOffset>0x000000ec</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DBIB_RDAT</name>
	<description>On Write:
31-30 bits: Specify the number of read cycles
0x0: 8 cycles
0x1: 16 cycles
0x2: 24 cycles
0x3: Used along with FMTCTRL[20:16] register bits
29-0 bits: Reserved

On Read:
31-0 bits: Read data from DBI Type-B/SPI interfaces</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_FMTCTRL_2_REG</name>
	<description>DBI and JDI format control</description>
	<addressOffset>0x000001a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>FMTCTRL</name>
	<description>Bits Description
When DBI-Type B Interface is selected:
Bits Description
31-16 bits: Reserved
15-0 bits: Specify the blanking period length for the X dimension
When JDI-Parallel Interface is selected:
Bits Description
31-20 bits: Reserved
19-10 bits: JDI ENB width
9-0 bits: JDI ENB offset</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_FMTCTRL_REG</name>
	<description>DBI and JDI format control</description>
	<addressOffset>0x000001a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>FMTCTRL</name>
	<description>When DBI-Type B Interface is selected:
Bits Description
31 bit : Candidate for DBIB_GE, associated with [15:8] bits (DSI interface specific)
30 bit : Candidate for DBIB_GE, associated with [7:0] bits (DSI interface specific)
29-21 bits: Reserved
20-16 bits: Specify the number of read cycles for SPI/DBI Type-B. Used along with DBIB_CFG[31:30]
register bits
0x0: 1 cycles
0x1: 2 cycles
0x2: 3 cycles
.
.
0x30: 31 cycles
0x31: 32 cycles
15-8 bits : Candidate DBIB_CT (DSI interface specific)
7-0 bits : Candidate DBIB_CT (DSI interface specific)
When JDI-Parallel Interface is selected:
Bits Description
31 bit : Mute DPI outputs
30 bit : Mask DPIREADY input
29 bit : Reserved
28-26 bits : JDI HST width
25-23 bits : JDI HST offset
22-13 bits : JDI VST width
12-3 bits : JDI VST offset
2-0 bits : Reserved</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_FRONTPORCHXY_REG</name>
	<description>Front Porch X and Y</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>FPORCH_X</name>
	<description>Front porch X (lines)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FPORCH_Y</name>
	<description>Front porch Y (pixel clocks)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_GPIO_REG</name>
	<description>General Purpose IO (8-bits)</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00004000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DPI_CM_ASSERT</name>
	<description>Assert DPI-2 Color Mode signal</description>
	<bitRange>[16:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DPI_SD_ASSERT</name>
	<description>Assert DPI-2 Shutdown signal</description>
	<bitRange>[15:15]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>SCAL_ADVANCE</name>
	<description>scalar advance</description>
	<bitRange>[14:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_OTHER</name>
	<description>TBD
</description>
	<bitRange>[12:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GPIO_SPI_SI_ON_SD_PAD</name>
	<description>Enable to have the SPI SI on the SPI SD pad</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GPIO_OUTPUT_MODE</name>
	<description>Select the mode that should be mapped on the GPIO pins
0x0 = JDI
0x1 = DPI
0x2 = DBI
0x3 = SPI</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GPIO_OUTPUT_EN</name>
	<description>Enable the GPIO pins for LCDC control. The GPIO_OUTPUT_MODE is used to define what LCDC pins will be mapped towards the GPIO pins.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TE_INV</name>
	<description>Applies an inversion on the TE (tearing effect) signal.
0 : the inversion is not applied on the TE signal
1 : the inversion is applied on TE signal</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLK_DIV_2DIV3</name>
	<description>Divide clock by 2/3 clock-gating. This is required when the DSI-DPHY is used with 2 lanes active.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_IDREG_REG</name>
	<description>Identification Register</description>
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>NEMADC_ID</name>
	<description>Identification register</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LCDC_INTERRUPT_REG</name>
	<description>Interrupt Register</description>
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>IRQ_TRIGGER_SEL</name>
	<description>IRQ trigger control
0: Level triggering
1: Edge triggering
In the case of the level triggering, the request remains active in the LCDC until to be cleared. The request can be cleared by performing a write access in the LCDC_INTERRUPT_REG. This is not required in the case of the edge triggering.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_OUT</name>
	
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FE_IRQ_EN</name>
	
